{
    "backing vocals": "Vocal parts that create atmosphere and emotion in conjunction with the lead vocals and the instrumentals.",
    "vocals": "Lead vocal parts and general vocal parts.",
    "MiniMoog synthesizer": "One of the most famous synthesizer in the world. It is a very simple synthesizer from Moog with a very low number of parameters. It is used in many popular music genres.",
    "ARP 2600 synthesizer": "Famous synthesizer from ARP used in the 70's and 80's. More technical than the MiniMoog synthesizer, the ARP 2600 didn't gain the same popularity as the MiniMoog.",
    "ARP Solina (synth)": "Very particular synthesizer from ARP. It simulates an orchestra of bowed strings with several but simple parameters. Today is really difficult to find.",
    "Moog synthesizer": "Generic synthesizer from Moog, the most famous synthesizers company in the world. The founder Robert Moog is considered to be the inventor of the synthesizer",
    "EMS synthesizer": "Generic synthesizer from Electronic Music Studios (EMS). One of the most famous synthesizers of EMS has been the VCS3.",
    "VCS synthesizer": "Series of synthesizers from Electronic Music Studios (EMS). The VCS3 is the most famous synthesizer of EMS.",
    "ARP synthesizer": "Generic synthesizer from ARP. It is used in the 70's and 80's.",
    "Eminent synthesizer": "Peculiar synthesizer from Eminent, has a lot of common with organs. It has been used in the 70's and 80's. Oxygene is one of the most representatives pieces of music that use this synthesizer.",
    "synthesizer": "Generic synthesizer.",
    "electric guitar": "Generic elecric guitar. The electric guitar is a guitar made from a solid wood body and steel strings. The sound is produced by the vibration of the strings the electric signal captured by the pickups. The electric guitar is used along a guitar amplifier, which has an amplifier circuit, which is usually realized with valves.",
    "classical guitar": "Generic classical guitar. The classical guitar has a hollow wood body and nylon strings. The classical guitar is used in the classical music genres and spanish/latino music.",
    "12-string acoustic guitar": "The 12-string acoustic guitar is a particular category of acoustic guitars with 12 strings instead of 6. Each of the 6 strings of the classic acoustic guitar is paired with another string tuned an octave above, except the high E, which is tuned to the same frequency. The 12-string acoustic guitar has a richer and fuller sound, with nuances produced by the slight detuning of the strings.",
    "9-string guitar": "The 9-string guitar is a particular category of guitars with 9 strings instead of 6.",
    "steel guitar": "A steel guitar is any guitar played while moving a steel bar or similar hard object against plucked strings. The instrument differs from a conventional guitar in that it is played without using frets.",
    "acoustic guitar": "The acoustic guitar is made of a hollow wood body and steel strings. The acoustic guitar is used in many musical genres, from folk, rock, country, pop, classical, jazz and many more. The acoustic guitar can usually be plugged in a guitar amplifier.",
    "guitar": "Generic guitar. The guitar is a musical instrument that is played by plucking the string. The guitar is a member of the family of string instruments and usually has 6 strings.",
    "electric bass": "The electric bass is a musical instrument made of a solid wood body and steel strings. While conceptually similar to the electric guitar, the electric bass has 4 strings like the upright bass, but is played by plucking the strings.",
    "bowed contrabass": "The bowed contrabass is a family of acoustic musical instruments in the family of bowed string instruments. The bowed contrabass has a lower register than the cello.",
    "bass": "Generic electric bass.",
    "double bass": "The double bass is a particular type of bowed contrabass. The double bass is also known as the upright bass.",
    "acoustic bass": "The acoustic bass is a musical instrument made of a hollow wood body and steel strings. This instruments is similar to the acoustic guitar but has 4 strings instead of 6.",
    "bass clarinet": "The bass clarinet is a musical instrument of the clarinet family. Like the more common soprano Bb clarinet, it is usually pitched in Bb (meaning it is a transposing instrument on which a written C sounds as Bb), but it plays notes an octave below the soprano Bb clarinet.",
    "drums": "A drum kit is a collection of drums, cymbals and other percussion instruments, which are set up on stands to be played by a single player, with drumsticks held in both hands and the feet operating pedals that control the hi-hat cymbal and the beater for the bass drum. A standard modern kit contains: a snare drum, a bass drum, two or more toms, played with sticks or brushes, a hi-hat (two cymbals mounted on a stand) and one or more cymbals",
    "steel drums": "The steelpan (also known as a pan, steel drum, and sometimes, collectively with other musicians, as a steelband or steel orchestra) is a musical instrument originating from Trinidad and Tobago. Steelpan musicians are called pannists.",
    "bells": "A bell is a directly struck idiophone percussion instrument. Most bells have the shape of a hollow cup that when struck vibrates in a single strong strike tone, with its sides forming an efficient resonator",
    "timbales": "Timbales or pailas are shallow single-headed drums with metal casing. They are shallower than single-headed tom-toms and usually tuned much higher, especially for their size. They were developed as an alternative to classical timpani in Cuba in the early 20th century and later spread across Latin America and the United States.",
    "gong": "A gong is a percussion instrument originating in East Asia and Southeast Asia. Gongs are a flat, circular metal disc that is typically struck with a mallet. They can be small or large in size, and tuned or untuned.",
    "timpani": "Timpani or kettledrums are musical instruments in the percussion family. A type of drum categorised as a hemispherical drum, they consist of a membrane called a head stretched over a large bowl traditionally made of copper.",
    "celesta": "The celesta or celeste, also called a bell-piano, is a struck idiophone operated by a keyboard. It looks similar to an upright piano (four or five-octave), albeit with smaller keys and a much smaller cabinet, or a large wooden music box (three-octave).",
    "cymbals": "A cymbal is a common percussion instrument. Often used in pairs, cymbals consist of thin, normally round plates of various alloys.",
    "whip": "In music, a whip or slapstick is a clapper (percussion instrument) consisting of two wooden boards joined by a hinge at one end. When the boards are brought together rapidly, the sound produces a sound reminiscent of the crack of a whip. It is often used in modern orchestras, bands, and percussion ensembles.",
    "tambourine": "The tambourine is a musical instrument in the percussion family consisting of a frame, often of wood or plastic, with pairs of small metal jingles, called zills.",
    "vibraphone": "The vibraphone is a percussion instrument in the metallophone family. It consists of tuned metal bars and is typically played by using mallets to strike the bars. A person who plays the vibraphone is called a vibraphonist, vibraharpist, or vibist.",
    "tubular bells": "Tubular bells (also known as chimes) are musical instruments in the percussion family. Their sound resembles that of church bells, carillon, or a bell tower; the original tubular bells were made to duplicate the sound of church bells within an ensemble.",
    "tabla": "A tabla is a pair of twin hand drums from the Indian subcontinent. Since the 18th century, tabla has been the principal percussion instrument in Hindustani classical music, where it may be played solo, as accompaniment with other instruments and vocals, and as a part of larger ensembles.",
    "triangle": "The triangle is an idiophone type of musical instrument in the percussion family. It is a bar of metal, usually steel but sometimes other metals such as beryllium copper, bent into a triangle shape.",
    "percussions": "Generic percussion instrument. The percussion is a musical instrument that produces sound by striking an object.",
    "bongos": "Bongos are an Afro-Cuban percussion instrument consisting of a pair of small open bottomed hand drums of different sizes. They are struck with both hands, most commonly in an eight-stroke pattern called martillo (hammer).",
    "sistro": "The sistro is an ancient musical instrument played by shaking it and producing a high pitched sound. The origin of the sistro is unknown, but it is believed to have been used by the egyptian people.",
    "congas": "The conga, also known as tumbadora, is a tall, narrow, single-headed drum from Cuba. Congas are staved like barrels and classified into three types: quinto (lead drum, highest), tres dos or tres golpes (middle), and tumba or salidor (lowest).",
    "small percussion": "Generic small percussion instrument.",
    "Mellotron": "The Mellotron is an electro-mechanical musical instrument developed in Birmingham, England, in 1963. It is played by pressing its keys, each of which pushes a length of magnetic tape against a capstan, which pulls it across a playback head.",
    "keyboards": "Generic keyboard instrument such as: piano, electric piano, organ, synth and more.",
    "Crumar harpsichord": "Harpsicord produced by the Crumar Italian aacompany.",
    "harpsichord": "A harpsichord is a musical instrument played by means of a keyboard. This activates a row of levers that turn a trigger mechanism that plucks one or more strings with a small plectrum made from quill or plastic. ",
    "clavinet": "The Clavinet is an electrically amplified clavichord invented by Ernst Zacharias and manufactured by the Hohner company of Trossingen, West Germany, from 1964 to 1982. The instrument produces sounds by a rubber pad striking a point on a tensioned string, and was designed to resemble the Renaissance-era clavichord.",
    "spinet": "A spinet is a smaller type of harpsichord or other keyboard instrument, such as a piano or organ.",
    "clavichord": "The clavichord is a stringed rectangular keyboard instrument[1] that was used largely in the Late Middle Ages, through the Renaissance, Baroque and Classical eras.",
    "Farfisa electric piano": "Electric piano produced by the Farfisa Italian company.",
    "electric piano": "Category of pianos that include electric keyboards that emulate the sound of a piano. Some examples are Fender Rhodes and the Wurlitzer.",
    "grand piano": "Type of piano in which the frame and strings are horizontal, with the strings extending away from the keyboard.",
    "piano": "The piano is a stringed keyboard instrument in which the strings are struck by wooden hammers that are coated with a softer material.",
    "Vox organ": "The Vox Continental is a transistorised combo organ that was manufactured between 1962 and 1971 by the British musical equipment manufacturer Vox.",
    "Pari organ": "Electromagnetic tonewheel organ produced by the Pari Italian company. This instrument is a B-3 clone which uses an actual electromagnetic tonewheel generator, albeit of modern plastic construction",
    "Hammond organ": "The Hammond organ is an electric organ invented by Laurens Hammond and John M. Hanert[6] and first manufactured in 1935.[7] Multiple models have been produced, most of which use sliding drawbars to vary sounds.",
    "pipe organ": "The pipe organ is a musical instrument that produces sound by driving pressurized air (called wind) through the organ pipes selected from a keyboard.",
    "harmonium": "The harmonium is a particular type of pump organ.",
    "organ": "Generic organ. The organ is an instrument that produces sound through air in pipes (pipe organs) or electric tonewheels (hammond organs).",
    "melodica": "The melodica is a handheld free-reed instrument similar to a pump organ or harmonica. It features a musical keyboard on top, and is played by blowing air through a mouthpiece that fits into a hole in the side of the instrument.",
    "clarino": "Particular type of clarinet.",
    "clarinet": "The clarinet is a type of single-reed woodwind instrument. Like many wind instruments, clarinets are made in several different sizes, each having its own range of pitches. All have a nearly-cylindrical bore and a flared bell, and utilize a mouthpiece with a single reed.",
    "E-flat clarinet": "The E-flat clarinet is a type of clarinet that is tuned to the E-flat key.",
    "contralto flute": "The contra-alto flute is a large member of the flute family, pitched between the bass flute and the contrabass flute.",
    "piccolo": "The piccolo is a half-size flute, and a member of the woodwind family of musical instruments.",
    "flute": "The flute is a family of musical instruments in the woodwind group. Unlike woodwind instruments with reeds, a flute is an aerophone or reedless wind instrument that produces its sound from the flow of air across an opening.",
    "contralto electric saxophone": "Particular type of electric saxophone.",
    "tenor electric saxophone": "Particular type of electric saxophone.",
    "soprano saxophone": "The soprano saxophone is a higher-register variety of the saxophone, a woodwind instrument invented in the 1840s.The soprano is the third-smallest member of the saxophone family, which consists (from smallest to largest) of the soprillo, sopranino, soprano, alto, tenor, baritone, bass, contrabass saxophone and tubax. Soprano saxophones are the smallest and thus highest-pitched saxophone in common use.",
    "baritone saxophone": "The baritone saxophone is a member of the saxophone family of instruments, larger (and lower-pitched) than the tenor saxophone, but smaller (and higher-pitched) than the bass.",
    "harmonica": "The harmonica, also known as a French harp or mouth organ, is a free reed brass instrument used worldwide in many musical genres, notably in blues, American folk music, classical music, jazz, country, and rock.",
    "horn": "A horn is any of a family of musical instruments made of a tube, usually made of metal and often curved in various ways, with one narrow end into which the musician blows, and a wide end from which sound emerges.",
    "alto saxophone": "The alto saxophone, also referred to as the alto sax, is a member of the saxophone family of woodwind instruments.",
    "trombone": "The trombone is a musical instrument in the brass family. As with all brass instruments, sound is produced when the player's vibrating lips (embouchure) cause the air column inside the instrument to vibrate.",
    "pocket trumpet": "The pocket trumpet is a Bb trumpet that is constructed with the tubing wound into a much smaller coil than a standard trumpet, generally with a smaller diameter bell.",
    "saxophone": "The saxophone is a type of single-reed woodwind instrument with a conical body, usually made of brass. As with all single-reed instruments, sound is produced when a reed on a mouthpiece vibrates to produce a sound wave inside the instrument's body.",
    "tenor saxophone": "The tenor saxophone is a medium-sized member of the saxophone family, a group of instruments invented by Adolphe Sax in the 1840s. The tenor and the alto are the two most commonly used saxophones.",
    "trumpet": "The trumpet is a brass instrument commonly used in classical and jazz ensembles.",
    "electric violin": "An electric violin is a violin equipped with an electronic output of its sound. The term most properly refers to an instrument intentionally made to be electrified with built-in pickups, usually with a solid body.",
    "mandocello": "The mandocello is a plucked string instrument of the mandolin family.",
    "sarangi": "The sarangi is a bowed, short-necked string instrument played in traditional music from India, Punjabi folk music, Rajasthani folk music, and Boro folk music, also in Pakistan and Bangladesh.",
    "violin": "The violin, sometimes known as a fiddle, is a wooden chordophone (string instrument) in the violin family. Most violins have a hollow wooden body.",
    "cello": "The cello is a bowed (sometimes plucked and occasionally hit) string instrument of the violin family. Its four strings are usually tuned in perfect fifths: from low to high, C2, G2, D3 and A3.",
    "mandolin": "The mandolin is a stringed musical instrument in the lute family and is generally plucked with a plectrum.",
    "electronic zither": "Electronic version of the zither. Zithers are stringed instruments typically played by strumming or plucking the strings with the fingers or a plectrum.",
    "theorbo": "The theorbo is a plucked string instrument of the lute family, with an extended neck and a second pegbox.",
    "mandola": "The mandola (US and Canada) or tenor mandola (Ireland and UK) is a fretted, stringed musical instrument.",
    "balalaika": "The balalaika is a Russian stringed musical instrument with a characteristic triangular wooden, hollow body, fretted neck and three strings. ",
    "sitar": "The sitar is a plucked stringed instrument, originating from the Indian subcontinent, used in Hindustani classical music. The instrument was invented in medieval India, flourished in the 16th and 17th centuries, and arrived at its present form in 18th-century India.",
    "orchestration": "Role of coordination of the music and the sounds.",
    "co-producer": "Person that has a production role but isn't the main producer.",
    "composer": "Person that creates music by writing parts for different musical instruments.",
    "producer": "Person that has the main production role for the piece of music.",
    "director": "Person that directs a musical performance.",
    "recorder": "Person that recods the music of a piece. The recorder has knowledge of the music and audio.",
    "arrangements": "Role of the person or the group that adapts the music to the context of the artist.",
    "frequency generator": "Generic signal generator. Usually referred to synthesizers.",
    "effects": "Generic effects",
    "audio oscillator": "Generic audio oscillator. Usually referred to synthesizers.",
    "audio generator": "Generic audio generator. Usually referred to synthesizers.",
    "performer": "Person that plays the main part in a musical piece. The performer is can be the only author of the musical piece.",
    "baritone electric saxophone": "Particular type of electric saxophone.",
    "8-string guitar": "Particular type of guitar.",
    "flugelhorn": "The flugelhorn also spelled fluegelhorn, flugel horn, or flügelhorn, is a brass instrument that resembles the trumpet and cornet but has a wider, more conical bore.",
    "French horn": "The French horn (since the 1930s known simply as the horn in professional music circles) is a brass instrument made of tubing wrapped into a coil with a flared bell.",
    "Hohner synthesizer": "Synthesizer from Hohner company.",
    "zither tirolese": "Folk stringed musical instrument used in south Germany, Slovenia, and Tyrol.",
    "ARP Odyssey synthesizer": "The ARP Odyssey is an analog synthesizer introduced by ARP Instruments in 1972. ARP developed the Odyssey as a direct competitor to the Moog Minimoog and an answer to the demand for more affordable, portable, and less complicated “performance” synthesizers.",
    "Hohner pianet": "The Hohner Pianet is a type of electro-mechanical piano built by the Hohner company of Trossingen, West Germany and designed by Ernst Zacharias. The Pianet was a variant of his earlier reed-based Hohner electric piano, the Cembalet, which, like the Pianet, was intended for home use.",
    "Elka synthesizer": "Particular polyphonic analog synthesizer. It has been used by Stevie Wonder and Jean Michel Jarre.",
    "slide guitar": "Slide guitar is a technique for playing the guitar that is often used in blues music. This technique is frenquently used with the steel guitar and acoustic guitar.",
    "Fender Rhodes": "The Rhodes piano (also known as the Fender Rhodes piano) is an electric piano invented by Harold Rhodes, which became popular in the 1970s. Like a conventional piano, the Rhodes generates sound with keys and hammers, but instead of strings, the hammers strike thin metal tines, which vibrate next to an electromagnetic pickup. The signal is then sent through a cable to an external keyboard amplifier and speaker.",
    "Shaj Baja": "The shahi baaja is an electrified and slightly modified version of the Indian bulbul tarang, a type of Indian zither to which have been added typewriter keys which depress two of the strings to change their pitch.",
    "Hohner clavinet": "Clavinet produced by Hohner.",
    "ocarina": "The ocarina is a wind musical instrument; it is a type of vessel flute.[1] Variations exist, but a typical ocarina is an enclosed space with four to twelve finger holes and a mouthpiece that projects from the body.",
    "prepared piano": "A prepared piano is a piano that has had its sounds temporarily altered by placing bolts, screws, mutes, rubber erasers, and/or other objects on or between the strings.",
    "glockenspiel": "The glockenspiel or bells is a percussion instrument. It consists of pitched aluminum or steel bars arranged in a keyboard layout.[1] This makes the glockenspiel a type of metallophone, similar to the vibraphone.",
    "viola": "The viola is a string instrument that is bowed, plucked, or played with varying techniques. Slightly larger than a violin, it has a lower and deeper sound.",
    "Logan String synthesizer": "The Logan String Melody designed by Ing. Giuliano Costantini for Logan was a portable keyboard produced in two versions from 1973 to 1982.[1] Manufactured in Italy, it was sold under both the Logan brand name and re-badged as both a Hohner and Vox product. The Vox version was called The String Thing but still featured the Logan brand name on the back of the case.",
    "Serve Tcherepnin synthesizer": "The Serge synthesizer (a.k.a. Serge Modular or Serge Modular Music System) is an analogue modular synthesizer system originally developed by Serge Tcherepnin, Rich Gold and Randy Cohen at CalArts in late 1972.",
    "Steinway piano": "Piano produced by Steinway.",
    "electric flute": "Electric version of the flute.",
    "autoharp": "An autoharp or chord zither is a string instrument belonging to the zither family. It uses a series of bars individually configured to mute all strings other than those needed for the intended chord.",
    "marimba": "The marimba is a musical instrument in the percussion family that consists of wooden bars that are struck by mallets. Below each bar is a resonator pipe that amplifies particular harmonics of its sound."
}