{
    "krautrock": "Krautrock is a musical genre that emerged in the late 1960s, mainly represented by groups from West Germany. It is a general term used for bands playing experimental, underground, psychedelic, or partly electronic types of music. Krautrock is originally a subgenre of progressive rock, but instead of following Anglo-American models of jazz and classical music, the German musicians (often inspired by the use of psychedelic drugs) created a quite different sound.The popular myth that \"Krautrock\" was coined by the English music press is not true. The first known use of the term is to be found in a Popo Music agency advertisement placed in Melody Maker (3 April 1971) and then a few weeks later in the USA Billboard magazine (29 May 1971) promoting its concert organising and artists on the Frankfurt based Bacillus label. That set the seeds for the American and British press adopting it. Initially considered insulting as the word kraut is slang for a German person, referring to the German dish \"sauerkraut\", the negative connotation disappeared as the music made by these bands since then was highly appreciated. Today, the word is honoring rather than insulting.Typical Krautrock bands in the early 1970s were Amon Düül II, Faust, Can and other bands associated with the producer/engineers: Conny Plank (Neu!, Kraftwerk and Cluster) and Dieter Dierks (Ash Ra Tempel, Tangerine Dream, etc.). Another early key-player was Rolf-Ulrich Kaiser and his Ohr, Pilz and Kosmische Musik labels. The composer Karlheinz Stockhausen also had influence on this experimental scene.Nowadays Krautrock is seen as an \"umbrella\" catch-all for the whole underground and progressive/experimental scene that developed in Germany during the 1970s and subsequent bands inspired by that unique scene. Most Collected Krautrock Music Explore More Popular Krautrock Music Neu! Neu! 0 0 0 Autobahn Kraftwerk 0 0 0 Tago Mago Can 0 0 0 Ege Bamyasi Can 0 0 0 Future Days Can 0 0 0 Stratosfear Tangerine Dream 0 0 0 Emperor Tomato Ketchup Stereolab 0 0 0 Krautrock Artists Tangerine Dream 0 0 0 Can 0 0 0 Faust 0 0 0 Circle 0 0 0 Popol Vuh 0 0 0 Birth Control 0 0 0 Guru Guru 0 0 0 Early Krautrock Releases Explore More Early Krautrock Music Phallus Dei Amon Düül II 0 0 0 Electrip Xhol Caravan 0 0 0 Hans Daniels Präsentiert Bonner Beat Bands Goin' Sad - Magic Spirit (2) - Take 5 + 2* 0 0 0 No Destination The Blackbirds (2) 0 0 0 Apocalypse - Original Soundtrack Of Cinerama Film \"Wunderland Der Liebe\" Apocalypse (11) 0 0 0 No Destination The Blackbirds (2) 0 0 0 Planet Earth Xhol Caravan 0 0 0 Krautrock Music Releases by Decade Top Submitters of Krautrock Music Most Sold Krautrock Releases This Month Explore More Trending Krautrock Music Ocean Eloy 0 0 0 Out Of Focus Out Of Focus 0 0 0 Neu! Neu! 0 0 0 Ege Bamyasi Can 0 0 0 Tago Mago Can 0 0 0 Ash Ra Tempel Ash Ra Tempel 0 0 0 Schwingungen Ash Ra Tempel 0 0 0 Related Styles of Music Psychedelic Rock Experimental Prog Rock Ambient Space Rock Avantgarde Indie Rock Post-Punk Synth-pop Art Rock Electro Leftfield Post Rock Alternative Rock Drone",
    "electronic": "Electronic music is music that employs electronic musical instruments and electronic music technology in its production, an electronic musician being a musician who composes and/or performs such music. In general a distinction can be made between sound produced using electromechanical means and that produced using electronic technology. Examples of electromechanical sound producing devices include the telharmonium, Hammond organ, and the electric guitar. Purely electronic sound production can be achieved using devices such as the theremin, sound synthesizer, and computer. Most Collected Electronic Music Explore More Popular Electronic Music Violator Depeche Mode 0 0 0 OK Computer Radiohead 0 0 0 In Rainbows Radiohead 0 0 0 Saturday Night Fever (The Original Movie Sound Track) Various 0 0 0 So Peter Gabriel 0 0 0 True Blue Madonna 0 0 0 Random Access Memories Daft Punk 0 0 0 Electronic Artists Moby 0 0 0 Depeche Mode 0 0 0 Madonna 0 0 0 Armin van Buuren 0 0 0 Tangerine Dream 0 0 0 Merzbow 0 0 0 Blank Embrace 0 0 0 Early Electronic Releases Explore More Early Electronic Music Le Crabe Qui Jouait Avec La Mer Philippe Arthuys 0 0 0 The Sounds And Music Of The RCA Electronic Music Synthesizer Various 0 0 0 Tape Recorder Music Otto Luening / Vladimir Ussachevsky 0 0 0 Rhythms Of The World Langston Hughes 0 0 0 Theme From \"Journey Into Space\" Frank Weir And His Saxophone And His Chorus And Orchestra* 0 0 0 Moonlight Sonata / The Swan Dr. Hoffman* 0 0 0 Пришла Весна / Старый Друг К. А. Лазаренко* / Л. Лядова*, Г. Островская*, М. Вдовенко* 0 0 0 Electronic Music Releases by Decade Top Submitters of Electronic Music Most Sold Electronic Releases This Month Explore More Trending Electronic Music Discovery Daft Punk 0 0 0 Northern Star Melanie C 0 0 0 To Hell With It PinkPantheress 0 0 0 1989 Remixes 1992 Electronic 0 0 0 Who's That Girl (Super Club Mix) Madonna 0 0 0 Bustin' + Dronin' Blur 0 0 0 Altered Reels Frankie Goes To Hollywood 0 0 0 Related Styles of Music House Techno Experimental Synth-pop Ambient Electro Trance Downtempo Disco Drum n Bass Deep House Tech House Euro House Industrial Hardcore",
    "mod": "The actual subculture that encompassed music, fashion, and the love of Vespa motor scooters and Italian fashion started in 1958 in London. Mod is short for Modernists, being either a fan or musician of modern jazz music. The influences to Mod culture consists of Jazz, R&B, power pop and soul. The first bands and artists that define the music are artists like Miles Davis and Ronnie Scott. The Who, Small Faces, and The Jam was rock bands favoured by the Mods due to the lyrics relation and revivalism of the culture. The Who's album Quadrophenia and the movie by the same name is a must listen and a must watch, as it was the soundtrack to the well known Mod movie of the same name. Most Collected Mod Music Explore More Popular Mod Music In The City The Jam 0 0 0 Sound Affects The Jam 0 0 0 The Who Sell Out The Who 0 0 0 Meaty, Beaty, Big & Bouncy The Who 0 0 0 Who's Next The Who 0 0 0 Quadrophenia The Who 0 0 0 My Generation The Who 0 0 0 Mod Artists The Jam 0 0 0 Paul Weller 0 0 0 The Style Council 0 0 0 The Kinks 0 0 0 Nino Ferrer 0 0 0 Small Faces 0 0 0 The Who 0 0 0 Early Mod Releases Explore More Early Mod Music Drum Twist / Bye, Bye Love Buddy Harman 0 0 0 Poor Fool / It's Gonna Work Out Fine Ike & Tina Turner 0 0 0 Alibi / What Difference Does It Makes Annette Bard 0 0 0 Play The Music Louder / Caveman Terry Fell 0 0 0 Neptune Part One / Neptune Part Two Sammy Benskin And The Spacemen 0 0 0 The Shake / The Big Operator Van Alexander And His Orchestra 0 0 0 Mod Music Releases by Decade Top Submitters of Mod Music Most Sold Mod Releases This Month Explore More Trending Mod Music Snap! The Jam 0 0 0 Who's Next The Who 0 0 0 Live At Leeds The Who 0 0 0 Walls Come Tumbling Down! The Style Council 0 0 0 My Generation The Who 0 0 0 Odds & Sods The Who 0 0 0 Live On The Riverboat Simon Fowler & Oscar Harrison 0 0 0 Related Styles of Music Beat Garage Rock Psychedelic Rock Pop Rock Power Pop Rhythm & Blues Soul Punk New Wave Indie Rock Rock & Roll Classic Rock Chanson Alternative Rock Vocal",
    "classic+rock": "Classic Rock was a genre mostly defined by US FM radio formats in the 1970s, growing out of the earlier Album Oriented Rock (AOR) format. It was a harder, often Blues and Prog influenced style and was a reaction against both Punk / New Wave and Disco.This style is not correctly applied to sixties or 70s Pop Rock, Beat or Garage Rock bands, such as The Beatles, The Yardbirds or The Rolling Stones (pre 1978).Other forms of Classic Rock: Southern rock is a subgenre of rock music and a genre of Americana. It developed in the Southern United States from rock and roll, country music, and blues and folk music. Most Collected Classic Rock Music Explore More Popular Classic Rock Music The Rise And Fall Of Ziggy Stardust And The Spiders From Mars David Bowie 0 0 0 Led Zeppelin II Led Zeppelin 0 0 0 Led Zeppelin III Led Zeppelin 0 0 0 Untitled Led Zeppelin 0 0 0 Brothers In Arms Dire Straits 0 0 0 Harvest Neil Young 0 0 0 Hotel California Eagles 0 0 0 Classic Rock Artists David Bowie 0 0 0 Eric Clapton 0 0 0 The Rolling Stones 0 0 0 Led Zeppelin 0 0 0 Queen 0 0 0 Status Quo 0 0 0 The Who 0 0 0 Early Classic Rock Releases Explore More Early Classic Rock Music Time Is On My Side The Rolling Stones 0 0 0 The \"Twang's\" The \"Thang\" Duane Eddy & His \"Twangy\" Guitar And The Rebel* 0 0 0 I'm A Lover Not A Fighter / Beautiful Delilah Kinks, The 0 0 0 Freddy King Goes Surfin' Freddie King 0 0 0 Go Now! / Lose Your Money The Moody Blues 0 0 0 ダイアモンド・ヘッド = Diamond Head / 朝日のあたる家 = The House Of The Rising Sun ベンチャーズ* = The Ventures 0 0 0 Time Is On My Side The Rolling Stones 0 0 0 Classic Rock Music Releases by Decade Top Submitters of Classic Rock Music Most Sold Classic Rock Releases This Month Explore More Trending Classic Rock Music Brothers In Arms Dire Straits 0 0 0 The Dark Side Of The Moon Pink Floyd 0 0 0 Anthem Of The Peaceful Army Greta Van Fleet 0 0 0 NFR! Lana Del Rey 0 0 0 At Carnegie Hall - April 9, 1971 Chicago (2) 0 0 0 Live 1979 Bad Company (3) 0 0 0 Face The Face Pete Townshend's Deep End* 0 0 0 Related Styles of Music Pop Rock Hard Rock Blues Rock Rock & Roll Psychedelic Rock Prog Rock Folk Rock Soft Rock Country Rock Arena Rock Glam Alternative Rock Soul Ballad Acoustic",
    "funk+/+soul": "Funk is a music genre that originated in the mid to late 1960s when African-American musicians created a rhythmic, danceable new form of music through a mixture of soul music, jazz, and R&B. Funk de-emphasizes melody and harmony and brings a strong rhythmic groove of electric bass and drums to the foreground. Funk songs are often based on an extended vamp on a single chord, distinguishing them from R&B and soul songs, which are built on chord progressions. Funk uses the same extended chords found in bebop jazz, such as minor chords with added sevenths and elevenths, or dominant seventh chords with altered ninths.Soul music is a popular music genre that originated in the United States in the 1950s and early 1960s. It combined elements of African-American gospel music, rhythm and blues, and often jazz. Soul music became popular for dancing and listening in the United States—where record labels such as Motown, Atlantic and Stax labels were influential during the period of the civil rights movement. Soul also became popular around the world, directly influencing rock music and the music of Africa.Northern Soul music was a  type of soul music that emerged from northern England in the 1960s. It was fresh, new, and upbeat (usually over 100 bpm). It was also sang by white and black people. The Northern Soul boom was between about 1965-1975. The Wigan Casino, Twisted Wheel, and Golden torch were some Northern Soul clubs, groups, and casinos that were Northern Soul hubs.Deep funk revival, naturally enough, grew out of a renewal of interest in deep (read: obscure) funk on both sides of the Atlantic, mostly among DJs and record collectors. Whether they were looking for fresh sample material or just a great overlooked dance.Retro-Soul is soul music that was made after the heyday of soul music had passed. Although deep soul had fallen out of the spotlight in the early '70s, there were a number of artists that never stopped singing in that raw style. In the mid-'80s, a small b... Most Collected Funk / Soul Music Explore More Popular Funk / Soul Music Bad Michael Jackson 0 0 0 Thriller Michael Jackson 0 0 0 Purple Rain Prince And The Revolution 0 0 0 Let's Dance David Bowie 0 0 0 Back To Black Amy Winehouse 0 0 0 Graceland Paul Simon 0 0 0 Songs In The Key Of Life Stevie Wonder 0 0 0 Funk / Soul Artists James Brown 0 0 0 Marvin Gaye 0 0 0 The Temptations 0 0 0 Prince 0 0 0 Ray Charles 0 0 0 Aretha Franklin 0 0 0 Diana Ross 0 0 0 Early Funk / Soul Releases Explore More Early Funk / Soul Music Sweeter As The Years Go By / Since Jesus Came Into My Heart Homer Rodeheaver 0 0 0 The Lonesome Road Sister Rosetta Tharpe 0 0 0 Brother Noah / What About Me? Rising Star Gospel Singers 0 0 0 His Eye Is On The Sparrow / Low Down The Chariot Coleman Brothers 0 0 0 Deep River / I Don't Feel No-Ways Tired (Negro Spiritual) Marian Anderson 0 0 0 Funk / Soul Music Releases by Decade Top Submitters of Funk / Soul Music Most Sold Funk / Soul Releases This Month Explore More Trending Funk / Soul Music Unlimited Love Red Hot Chili Peppers 0 0 0 Live In Loveland! Delvon Lamarr Organ Trio 0 0 0 Blue Velvet (Original Motion Picture Soundtrack) Angelo Badalamenti 0 0 0 Vanille Fraise L'impératrice 0 0 0 More Hot Rocks (Big Hits & Fazed Cookies) Rolling Stones* 0 0 0 #1's Mariah* 0 0 0 #1's Mariah Carey 0 0 0 Related Styles of Music Soul Disco Funk Rhythm & Blues Gospel Pop Rock Jazz-Funk Vocal Contemporary R&B Ballad Synth-pop RnB/Swing House Boogie Soul-Jazz",
    "beat": "Beat music, British beat, or Merseybeat (after bands from Liverpool and nearby areas beside the River Mersey) is a rock music genre that developed in the United Kingdom in the early 1960s. Beat music is a style of rock and roll influenced by Chuck Berry guitar style and the midtempo beat of artists like Buddy Holly. It also adds a fusion of doo-wop, skiffle and R&B. The genre provided many of the bands responsible for the British Invasion of the American pop charts starting in 1964, and provided the model for many important developments in pop and rock music, including the format of the rock group around lead, rhythm and bass guitars with drums. Most Collected Beat Music Explore More Popular Beat Music 1962-1966 The Beatles 0 0 0 A Hard Day's Night The Beatles 0 0 0 Please Please Me The Beatles 0 0 0 Rubber Soul The Beatles 0 0 0 Beatles For Sale The Beatles 0 0 0 Help! The Beatles 0 0 0 1 The Beatles 0 0 0 Beat Artists The Rolling Stones 0 0 0 The Beatles 0 0 0 The Kinks 0 0 0 The Hollies 0 0 0 Herman's Hermits 0 0 0 The Searchers 0 0 0 The Dave Clark Five 0 0 0 Early Beat Releases Explore More Early Beat Music The Big Guitar Owen Bradley And His Orchestra 0 0 0 You Send Me / My Special Angel Barry Frank 0 0 0 Melvis Rock Band Melvis Rock Band 0 0 0 Who, Baby Who Terry Dene 0 0 0 Frankie, My Darling Lorenza Lory Con I Trovatori 0 0 0 By You, By You / Forgive Me Bill And Brett Landis And The Rita Williams Singers 0 0 0 Ogni Notte Cosi' / Non E' Così Fred Buscaglione E I Suoi Asternovas 0 0 0 Beat Music Releases by Decade Top Submitters of Beat Music Most Sold Beat Releases This Month Explore More Trending Beat Music You'll Never Walk Alone Gerry And The Pacemakers* 0 0 0 Beatles For Sale The Beatles 0 0 0 Help! The Beatles 0 0 0 1962-1966 The Beatles 0 0 0 Please Please Me The Beatles 0 0 0 Cozy Winter Various 0 0 0 Foolish Seasons Dana Gillespie 0 0 0 Related Styles of Music Pop Rock Garage Rock Rock & Roll Psychedelic Rock Mod Vocal Rhythm & Blues Ballad Chanson Soul Surf Schlager Folk Rock Blues Rock Classic Rock",
    "free+jazz": "Free jazz is an approach to jazz music that was first developed in the 1950s and 1960s. Though the music of free jazz composers varied widely, a common feature was dissatisfaction with the limitations of bebop, hard bop, and modal jazz that had developed in the 1940s and 1950s. Free jazz musicians attempted to alter, extend, or break down jazz convention, often by discarding fixed chord changes or tempos. While usually considered avant-garde, free jazz has also been described as an attempt to return jazz to its primitive, often religious, roots and emphasis on collective improvisation.Free jazz is strongly associated with the 1950s innovations of Ornette Coleman and Cecil Taylor and the later works of saxophonist John Coltrane. Other important pioneers include Charles Mingus, Eric Dolphy, Albert Ayler, Archie Shepp, Joe Maneri and Sun Ra. Coleman pioneered many techniques typical of free jazz, most notably his rejection of pre-written chord changes, believing instead that freely improvised melodic lines should serve as the basis for harmonic progression in his compositions. Some of bassist Charles Mingus's work was also important in establishing free jazz.Typically this kind of music is played by small groups of musicians, although some examples use larger numbers. Other forms of jazz use clear regular meters and strongly pulsed rhythms. Free jazz normally retains a general pulsation but without regular meter, and we encounter frequent accelerando and ritardando, giving an impression of the rhythm moving in waves. Previous jazz forms used harmonic structures (usually cycles of diatonic chords). Free jazz almost by definition is free of such structures, but also by definition (it is, after all, \"jazz\" as much as it is \"free\") it retains much of the language of earlier jazz playing. Most Collected Free Jazz Music Explore More Popular Free Jazz Music Free Jazz The Ornette Coleman Double Quartet 0 0 0 A Love Supreme John Coltrane 0 0 0 Weasels Ripped My Flesh The Mothers Of Invention* 0 0 0 Coltrane The John Coltrane Quartette* 0 0 0 The Shape Of Jazz To Come Ornette Coleman 0 0 0 Out To Lunch! Eric Dolphy 0 0 0 Cowboy Bebop The Seatbelts 0 0 0 Free Jazz Artists Archie Shepp 0 0 0 Steve Lacy 0 0 0 John Coltrane 0 0 0 Cecil Taylor 0 0 0 Anthony Braxton 0 0 0 Ornette Coleman 0 0 0 The Sun Ra Arkestra 0 0 0 Early Free Jazz Releases Explore More Early Free Jazz Music The Shape Of Jazz To Come Ornette Coleman 0 0 0 Something Else!!!! Ornette Coleman 0 0 0 Love For Sale Cecil Taylor Trio And Quintet* 0 0 0 Jazz Advance Cecil Taylor Quartet* 0 0 0 At Newport The Gigi Gryce-Donald Byrd Jazz Laboratory* & The Cecil Taylor Quartet 0 0 0 Toshiko & Leon Sash At Newport Toshiko Akiyoshi & Leon Sash 0 0 0 Halló, Boogie Kovács Andor* 0 0 0 Free Jazz Music Releases by Decade Top Submitters of Free Jazz Music Most Sold Free Jazz Releases This Month Explore More Trending Free Jazz Music Sleeping Beauty Sun Ra And His Intergalactic Myth Science Solar Arkestra* 0 0 0 Nation Time Joe McPhee 0 0 0 Out To Lunch! Eric Dolphy 0 0 0 A Love Supreme: Live In Seattle John Coltrane 0 0 0 Japanese Jazz Spectacle Vol. I (Deep, Heavy & Beautiful Jazz From Japan 1968-1984) Various 0 0 0 Spencer (Original Motion Picture Soundtrack) Jonny Greenwood 0 0 0 Revelations - The Complete ORTF 1970 Fondation Maeght Recordings Albert Ayler 0 0 0 Related Styles of Music Free Improvisation Contemporary Jazz Avant-garde Jazz Experimental Post Bop Avantgarde Fusion Noise Modal Jazz-Rock Soul-Jazz Jazz-Funk Hard Bop Big Band Abstract",
    "prog+rock": "Progressive rock is a rock music subgenre that originated in the United Kingdom and United States throughout the mid to late 1960s. It developed from psychedelic rock, and began as an attempt to give greater artistic weight and credibility to rock music. Songs were replaced by musical suites that often stretched to 20 or 40 minutes in length and contained symphonic influences, extended musical themes, fantasy-like ambience and lyrics, and complex orchestrations. Most Collected Prog Rock Music Explore More Popular Prog Rock Music The Dark Side Of The Moon Pink Floyd 0 0 0 Animals Pink Floyd 0 0 0 The Wall Pink Floyd 0 0 0 Wish You Were Here Pink Floyd 0 0 0 Meddle Pink Floyd 0 0 0 Aqualung Jethro Tull 0 0 0 In The Court Of The Crimson King (An Observation By King Crimson) King Crimson 0 0 0 Prog Rock Artists Jethro Tull 0 0 0 Pink Floyd 0 0 0 Yes 0 0 0 Rush 0 0 0 King Crimson 0 0 0 Genesis 0 0 0 Marillion 0 0 0 Early Prog Rock Releases Explore More Early Prog Rock Music Noi Non Ci Saremo I Nomadi* 0 0 0 Noi Non Ci Saremo I Nomadi* 0 0 0 Come Potete Giudicar / La Mia Libertà I Nomadi* 0 0 0 L'Amaro In Bocca / Black Time I Rokketti 0 0 0 Basta Essere Belle Various 0 0 0 Babababa-ba / Una Bambolina Che Fa No No No I Satelliti, Quelli 0 0 0 Babababa-ba I Satelliti 0 0 0 Prog Rock Music Releases by Decade Top Submitters of Prog Rock Music Most Sold Prog Rock Releases This Month Explore More Trending Prog Rock Music Lateralus Tool (2) 0 0 0 The Dark Side Of The Moon Pink Floyd 0 0 0 Fear Inoculum Tool (2) 0 0 0 My Arms, Your Hearse Opeth 0 0 0 Tubular Bells II Mike Oldfield 0 0 0 At Carnegie Hall - April 9, 1971 Chicago (2) 0 0 0 Angel Rat Voivod* 0 0 0 Related Styles of Music Psychedelic Rock Pop Rock Hard Rock Art Rock Symphonic Rock Experimental Folk Rock Classic Rock Jazz-Rock Heavy Metal Alternative Rock Fusion Avantgarde Blues Rock Krautrock",
    "fusion": "Fusion or Jazz Fusion is a subgenre of Jazz with elements of Progressive, Psychedelic rock music. It also has elements of Funk, Bebop, and 20th Century Classical Music. The Genre's Orgins come from The Late 1960s. Most Collected Fusion Music Explore More Popular Fusion Music Bitches Brew Miles Davis 0 0 0 In A Silent Way Miles Davis 0 0 0 Abraxas Santana 0 0 0 Hot Rats Frank Zappa 0 0 0 Caravanserai Santana 0 0 0 The Nightfly Donald Fagen 0 0 0 Chicago Transit Authority Chicago Transit Authority* 0 0 0 Fusion Artists Herbie Hancock 0 0 0 Weather Report 0 0 0 Miles Davis 0 0 0 Billy Cobham 0 0 0 Frank Zappa 0 0 0 Kazumi Watanabe 0 0 0 Casiopea 0 0 0 Early Fusion Releases Explore More Early Fusion Music Herbie Mann Returns To The Village Gate Herbie Mann 0 0 0 East Meets West Ahmed Abdul-Malik 0 0 0 The Music Of Ahmed Abdul-Malik Ahmed Abdul-Malik 0 0 0 The Eastern Moods Of Ahmed Abdul-Malik Ahmed Abdul-Malik 0 0 0 Perfect Percussion: The 44 Instruments Of Roy Harte And Milt Holland Roy Harte & Milt Holland 0 0 0 The Hustlers / La Ibkey Ahmed Abdul-Malik 0 0 0 Plays \"Walk On The Wild Side\" And \"The Preacher\" Jimmy Smith 0 0 0 Fusion Music Releases by Decade Top Submitters of Fusion Music Most Sold Fusion Releases This Month Explore More Trending Fusion Music Songs In The Key Of Life Stevie Wonder 0 0 0 Brasilian Skies Masayoshi Takanaka 0 0 0 Check Your Head Beastie Boys 0 0 0 All Of Me Masayoshi Takanaka 0 0 0 The Elements Joe Henderson Featuring Alice Coltrane 0 0 0 Kakashi Yasuaki Shimizu 0 0 0 Cat Hiroshi Suzuki (2) 0 0 0 Related Styles of Music Jazz-Rock Jazz-Funk Contemporary Jazz Prog Rock Latin Jazz Funk Smooth Jazz Experimental Soul-Jazz Free Jazz Post Bop Folk Disco Ambient Easy Listening",
    "rock": "Rock music or rock and roll in full name is a genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the late 1950s, 1960s and later, particularly in the United Kingdom and the United States. Its roots are in 1950s' American rock and roll when and where it first started, itself heavily influenced by rhythm and blues and country music. Rock music also drew strongly on a number of other genres such as blues and folk, and incorporated influences from jazz, classical and other musical sources.In its purest form, Rock & Roll has three chords, a strong, insistent back beat, and a catchy melody. Early rock & roll drew from a variety of sources, primarily blues, R&B, and country, but also gospel, traditional pop, jazz, and folk. All of these influences combined in a simple, blues-based song structure that was fast, danceable, and catchy. The first wave of rock & rollers -- Chuck Berry, Elvis Presley, Little Richard, Jerry Lee Lewis, Buddy Holly, Bo Diddley, Bill Haley, Gene Vincent, the Everly Brothers, and Carl Perkins, among many others -- set the template for rock & roll that was followed over the next four decades. Most Collected Rock Music Explore More Popular Rock Music Untitled Led Zeppelin 0 0 0 The Dark Side Of The Moon Pink Floyd 0 0 0 The Wall Pink Floyd 0 0 0 Wish You Were Here Pink Floyd 0 0 0 Sgt. Pepper's Lonely Hearts Club Band The Beatles 0 0 0 Abbey Road The Beatles 0 0 0 Rumours Fleetwood Mac 0 0 0 Rock Artists David Bowie 0 0 0 Metallica 0 0 0 The Rolling Stones 0 0 0 Elvis Presley 0 0 0 Led Zeppelin 0 0 0 Pink Floyd 0 0 0 The Beatles 0 0 0 Early Rock Releases Explore More Early Rock Music Besame Mucho (Kiss Me Much) / You Gotta Love Me Baby The Ray-O-Vacs 0 0 0 I'm Just A Fool / Paw's In The Kitchen James Quintet 0 0 0 You're Heartless / Careless Love The Four Tunes 0 0 0 Rock Around The Clock / Fine As Wine Hal Singer And His Orchestra 0 0 0 Don't Ask Me Why / I Can Hardly Wait The Four Sharps (3) 0 0 0 Messy Bessie / Boogie Woogie Jive Ivy Willis 0 0 0 Rock Music Releases by Decade Top Submitters of Rock Music Most Sold Rock Releases This Month Explore More Trending Rock Music We Die Young Alice In Chains 0 0 0 Making A Fire (Mark Ronson Re-Version) / Chasing Birds (Preservation Hall Jazz Band Re-Version) Foo Fighters 0 0 0 Greatest Hits The Offspring 0 0 0 Northern Star Melanie C 0 0 0 Live Seeds Nick Cave & The Bad Seeds 0 0 0 I'm So Free: The 1971 RCA Demos Lou Reed 0 0 0 Wembley Empire Pool, London, England 4/8/72 The Grateful Dead 0 0 0 Related Styles of Music Pop Rock Punk Indie Rock Alternative Rock Hardcore Rock & Roll Psychedelic Rock Hard Rock Black Metal Heavy Metal Folk Rock Prog Rock Experimental Garage Rock Death Metal",
    "jazz": "Jazz is a genre of music that originated in African-American communities during the late 19th and early 20th century. Jazz emerged in many parts of the United States of independent popular musical styles; linked by the common bonds of European American and African-American musical parentage with a performance orientation. Jazz spans a range of music from ragtime to the present day—a period of over 100 years—and has proved to be very difficult to define. Jazz makes heavy use of improvisation, polyrhythms, syncopation, and the swung note, as well as aspects of European harmony, American popular music, the brass band tradition, and African musical elements such as blue notes and ragtime. A musical group that plays jazz is called a jazz band.While New Orleans jazz has improvised ensembles, when jazz started becoming popular in the 1920s and demand was growing for larger dance bands, it became necessary for ensembles to be written down, particularly when a group included more than three... Most Collected Jazz Music Explore More Popular Jazz Music Kind Of Blue Miles Davis 0 0 0 Aja Steely Dan 0 0 0 A Love Supreme John Coltrane 0 0 0 Time Out The Dave Brubeck Quartet 0 0 0 Diamond Life Sade 0 0 0 Graceland Paul Simon 0 0 0 ★ (Blackstar) David Bowie 0 0 0 Jazz Artists Miles Davis 0 0 0 Ella Fitzgerald 0 0 0 Billie Holiday 0 0 0 Louis Armstrong 0 0 0 Frank Sinatra 0 0 0 Nat King Cole 0 0 0 Duke Ellington And His Orchestra 0 0 0 Early Jazz Releases Explore More Early Jazz Music The Laughing Song George W. Johnson 0 0 0 Just One Girl Frank Butts 0 0 0 Chicken Chowder Ossman-Dudley Trio 0 0 0 Minstrels / The Laughing Song Unknown Artist / George W. Johnson 0 0 0 Old Bill Jones Arthur Collins 0 0 0 I'd Leave My Happy Home For You Arthur Collins 0 0 0 Mr. Black Man Edison Military Band 0 0 0 Jazz Music Releases by Decade Top Submitters of Jazz Music Most Sold Jazz Releases This Month Explore More Trending Jazz Music Inner Spirit: The 1979 Concert At The Teatro General San Martín, Buenos Aires Bill Evans 0 0 0 Morning Glory: The 1973 Concert At The Teatro Gran Rex, Buenos Aires Bill Evans 0 0 0 The Lost Album From Ronnie Scott's Charles Mingus 0 0 0 Art Pepper Meets The Rhythm Section Art Pepper 0 0 0 Live In Loveland! Delvon Lamarr Organ Trio 0 0 0 Making A Fire (Mark Ronson Re-Version) / Chasing Birds (Preservation Hall Jazz Band Re-Version) Foo Fighters 0 0 0 Blue Velvet (Original Motion Picture Soundtrack) Angelo Badalamenti 0 0 0 Related Styles of Music Easy Listening Big Band Swing Vocal Contemporary Jazz Fusion Jazz-Funk Soul-Jazz Bop Latin Jazz Jazz-Rock Free Jazz Free Improvisation Cool Jazz Dixieland",
    "stage+&+screen": "This genre is reserved for music associated with musicals, soundtracks, plays, and other scores. Most Collected Stage & Screen Music Explore More Popular Stage & Screen Music The Soundtrack From The Film The Song Remains The Same Led Zeppelin 0 0 0 Purple Rain Prince And The Revolution 0 0 0 Saturday Night Fever (The Original Movie Sound Track) Various 0 0 0 A Hard Day's Night The Beatles 0 0 0 Tea For The Tillerman Cat Stevens 0 0 0 Help! The Beatles 0 0 0 Grease (The Original Soundtrack From The Motion Picture) Various 0 0 0 Stage & Screen Artists Ennio Morricone 0 0 0 Elvis Presley 0 0 0 Shankar-Jaikishan 0 0 0 John Williams (4) 0 0 0 R. D. Burman 0 0 0 Laxmikant-Pyarelal 0 0 0 Sameer 0 0 0 Early Stage & Screen Releases Explore More Early Stage & Screen Music Ma Jolie Mercadier* 0 0 0 Minstrels / The Laughing Song Unknown Artist / George W. Johnson 0 0 0 THE LAUGHING SONG Burt Shepard 0 0 0 Musical Moke Arthur Collins, Len Spencer 0 0 0 Jao Jao Mose Na Bolo Miss Mulkajan 0 0 0 Waltz Me Around Again Willie Billy Murray and Haydn Quartet 0 0 0 Lullaby-Jocelyn Mme. A. Michailowa* 0 0 0 Stage & Screen Music Releases by Decade Top Submitters of Stage & Screen Music Most Sold Stage & Screen Releases This Month Explore More Trending Stage & Screen Music Purple Rain Prince And The Revolution 0 0 0 Lost In Translation (Music From The Motion Picture Soundtrack) Various 0 0 0 Inside (The Songs) Bo Burnham 0 0 0 High Scores From The Golden Age Of 8-Bit Gaming Various 0 0 0 Breakin': Original Motion Picture Soundtrack Various 0 0 0 Blue Velvet (Original Motion Picture Soundtrack) Angelo Badalamenti 0 0 0 True Colors (From Life Is Strange) mxmtoon 0 0 0 Related Styles of Music Soundtrack Score Theme Musical Vocal Easy Listening Bollywood Hindustani Pop Rock Ballad Ambient Chanson Video Game Music Experimental Modern Classical",
    "blues+rock": "A Soul, Blues, and Rock mixture. Usually a form  of Blue-Eyed Soul. Most Collected Blues Rock Music Explore More Popular Blues Rock Music Black Sabbath Black Sabbath 0 0 0 Led Zeppelin Led Zeppelin 0 0 0 Led Zeppelin II Led Zeppelin 0 0 0 Untitled Led Zeppelin 0 0 0 Sticky Fingers The Rolling Stones 0 0 0 Are You Experienced The Jimi Hendrix Experience 0 0 0 L.A. Woman Doors* 0 0 0 Blues Rock Artists Eric Clapton 0 0 0 The Rolling Stones 0 0 0 Led Zeppelin 0 0 0 Fleetwood Mac 0 0 0 Jimi Hendrix 0 0 0 Cream (2) 0 0 0 The Yardbirds 0 0 0 Early Blues Rock Releases Explore More Early Blues Rock Music Mean Woman Blues / Blue Bayou Roy Orbison 0 0 0 I Wanna Be Your Man The Rolling Stones 0 0 0 Baby, What's Wrong / Where There's A Will Lonnie Mack 0 0 0 Let Me Cry / You're Divine Dear Peppino Di Capri E I Suoi \"Rockers\"* 0 0 0 Bella Ragazzina Di Verona / Solo Con Me / Dai Fai La Brava Ghigo* 0 0 0 Love Letters / Since I Met You Baby Ace Cannon 0 0 0 Blues Rock Music Releases by Decade Top Submitters of Blues Rock Music Most Sold Blues Rock Releases This Month Explore More Trending Blues Rock Music Anthem Of The Peaceful Army Greta Van Fleet 0 0 0 From The Fires Greta Van Fleet 0 0 0 Eve Speed, Glue & Shinki 0 0 0 Love Over Gold Dire Straits 0 0 0 L.A. Woman Sessions Doors* 0 0 0 Live 1979 Bad Company (3) 0 0 0 Face The Face Pete Townshend's Deep End* 0 0 0 Related Styles of Music Classic Rock Psychedelic Rock Hard Rock Pop Rock Rock & Roll Folk Rock Country Rock Alternative Rock Garage Rock Prog Rock Rhythm & Blues Southern Rock Acoustic Electric Blues Indie Rock",
    "symphonic+rock": "Symphonic rock is a sub-genre of progressive rock. Since early in progressive rock's history, the term has been used to distinguish more classically influenced progressive rock from the more psychedelic and experimental forms of progressive rock. Most Collected Symphonic Rock Music Explore More Popular Symphonic Rock Music Atom Heart Mother Pink Floyd 0 0 0 A New World Record Electric Light Orchestra 0 0 0 Discovery Electric Light Orchestra 0 0 0 Out Of The Blue Electric Light Orchestra 0 0 0 Fragile Yes 0 0 0 Close To The Edge Yes 0 0 0 In The Court Of The Crimson King (An Observation By King Crimson) King Crimson 0 0 0 Symphonic Rock Artists Yes 0 0 0 The Alan Parsons Project 0 0 0 Electric Light Orchestra 0 0 0 Rick Wakeman 0 0 0 Ekseption 0 0 0 Barclay James Harvest 0 0 0 The Enid 0 0 0 Early Symphonic Rock Releases Explore More Early Symphonic Rock Music Freak Out! The Mothers Of Invention* 0 0 0 The Rolling Stones Songbook The Andrew Oldham Orchestra* 0 0 0 Anything Goes Harpers Bizarre 0 0 0 Danza Del Fuego / Recuerdos De La Alhambra Los Relampagos 0 0 0 Los Relampagos Los Relampagos 0 0 0 La Santa Espina Los Relampagos 0 0 0 Rock N' Roll Various 0 0 0 Symphonic Rock Music Releases by Decade Top Submitters of Symphonic Rock Music Most Sold Symphonic Rock Releases This Month Explore More Trending Symphonic Rock Music Time ELO* 0 0 0 A New World Record Electric Light Orchestra 0 0 0 Script For A Jester's Tear Marillion 0 0 0 Discovery Electric Light Orchestra 0 0 0 Discovery Electric Light Orchestra 0 0 0 Sweet Heart, Sweet Light Spiritualized?* 0 0 0 Eldorado - A Symphony By The Electric Light Orchestra Electric Light Orchestra 0 0 0 Related Styles of Music Prog Rock Pop Rock Art Rock Heavy Metal Classic Rock Hard Rock Psychedelic Rock Folk Rock Alternative Rock Synth-pop Soft Rock Goth Rock Experimental Ballad Acoustic",
    "glam": "The original Glam was a poppy UK (and NYC) pre-punk style that was often rhythm heavy, albeit with short snappy, almost Rock & Roll, songs. The artists wore heavy makeup and often outrageous costumes. It heavily influenced the second style below, and the UK punk revolution of 1976. Poppy heavy metal music popular throughout the later 1980's and the first part of the 1990's. Vocals are usually harmonized and the songs are very accessible by mass audiences.Glam metal, also known as hair metal or pop metal, is a subgenre of heavy metal. Most Collected Glam Music Explore More Popular Glam Music The Rise And Fall Of Ziggy Stardust And The Spiders From Mars David Bowie 0 0 0 Hunky Dory David Bowie 0 0 0 Aladdin Sane David Bowie 0 0 0 Greatest Hits Queen 0 0 0 Diamond Dogs Bowie* 0 0 0 Transformer Lou Reed 0 0 0 Slippery When Wet Bon Jovi 0 0 0 Glam Artists David Bowie 0 0 0 Queen 0 0 0 Slade 0 0 0 Kiss 0 0 0 The Sweet 0 0 0 T. Rex 0 0 0 Marc Bolan 0 0 0 Early Glam Releases Explore More Early Glam Music Beginnings Ambrose Slade 0 0 0 Let Me Tell Ya U.K. Jones 0 0 0 King Of The Rumbling Spires Tyrannosaurus Rex 0 0 0 Pewter Suitor Tyrannosaurus Rex 0 0 0 They're Coming To Take Me Away, Ha Haa! Kim Fowley 0 0 0 Ginger Bread Man Jordan Parker Revue 0 0 0 Hippy Gumbo Marc Bolan 0 0 0 Glam Music Releases by Decade Top Submitters of Glam Music Most Sold Glam Releases This Month Explore More Trending Glam Music Greatest Hits Queen 0 0 0 Hunky Dory David Bowie 0 0 0 The Rise And Fall Of Ziggy Stardust And The Spiders From Mars David Bowie 0 0 0 The Rise And Fall Of Ziggy Stardust And The Spiders From Mars David Bowie 0 0 0 The Life Aquatic With Steve Zissou (Original Soundtrack) Various 0 0 0 Danger Danger Danger Danger 0 0 0 Waking The Dead L.A. Guns 0 0 0 Related Styles of Music Hard Rock Pop Rock Classic Rock Punk Heavy Metal Rock & Roll Alternative Rock Garage Rock Disco Art Rock Psychedelic Rock New Wave Power Pop Arena Rock Synth-pop",
    "big+band": "Should be used to describe recordings by a large orchestra which feature brass sections with multiple trumpets and trombones and a large reed section. A feature is that whole sections (the brass, the reeds) often play some parts of the tune in unison while leaving room for soloists at certain times. This style of orchestra began to be developed in the early 1920s by prominent dance band leaders such as Paul Whiteman and Fletcher Henderson, but the majority of 1920s dance bands were smaller groups and did not play in the \"big band\" style. It was not until 1929/30 or so that the majority of dance bands adopted this configuration (examples are the Casa Loma Orchestra, Mills Blue Rhthm Band, Duke Ellington's Orchestra) and big bands became the norm from the mid-1930s onwards. This style should be use sparingly before about 1930 as while there were other orchestras recorded similar to those led by Whiteman and Henderson (already mentioned) the majority of 1920s dance bands are not \"big bands\". From the 1930s onwards this style can be applied to recordings by any large orchestra. There were both jazz big bands (such as Benny Goodman, Tommy Dorsey, Glenn Miller, Jimmy Lunceford, Count Basie, etc.) and \"sweet\" big bands (such as Freddy Martin, Sammy Kaye, and Guy Lombardo's Royal Canadians). This style is often linked to the \"swing\" style (as in \"big bands of the swing era\") but it is better to avoid use the big band and swing tags together as they do not mean exactly the same thing. In reality not all swing groups were big bands, and some big bands featured small groups made up of star musicians from the larger orchestra (Benny Goodman Trio/Quartet/Sextet, Tommy Dorsey's Clambake Seven, Artie Shaw's Gramercy Five, etc.) and it is these smaller groups which played in the \"swing\" style. A useful distinction is that big band recordings feature large amounts of section work (notably the brass and/or the reeds) while smaller \"swing\" groups were more about featured soloists backed by a rhythm section. The big band style was most  prominent during the 1930s and 1940s but was still very popular up into the 1950s and many big band style recordings continued to be made during the 1960s and later. Most Collected Big Band Music Explore More Popular Big Band Music I'm Breathless (Music From And Inspired By The Film Dick Tracy) Madonna 0 0 0 Post Björk 0 0 0 Miles Ahead Miles Davis + 19 - Orchestra Under The Direction Of Gil Evans 0 0 0 Porgy And Bess Miles Davis 0 0 0 Come Fly With Me Frank Sinatra 0 0 0 Frank Sinatra's Greatest Hits Frank Sinatra 0 0 0 Sinatra At The Sands Frank Sinatra 0 0 0 Big Band Artists Frank Sinatra 0 0 0 Duke Ellington 0 0 0 Count Basie Orchestra 0 0 0 Tommy Dorsey And His Orchestra 0 0 0 Harry James And His Orchestra 0 0 0 Duke Ellington And His Orchestra 0 0 0 Glenn Miller And His Orchestra 0 0 0 Early Big Band Releases Explore More Early Big Band Music On Miami Shore Beck's Orchestra*, Coleman's Orchestra* 0 0 0 Artful Artie Two-Step / A Day At West Point Arthur Pryor's Band 0 0 0 The First Rose Of Summer / Somebody's Heart The Happy Six 0 0 0 March Of The Little Pierrots / Sharpshooters' March Prince's Band 0 0 0 No One But You / It Gets Them All Waldorf-Astoria Dance Orchestra* 0 0 0 Battle Of The Nations / Napoleon's Last Charge Prince's Band 0 0 0 My Baby's Arms / On The Streets Of Cairo Art Hickman's Orchestra 0 0 0 Big Band Music Releases by Decade Top Submitters of Big Band Music Most Sold Big Band Releases This Month Explore More Trending Big Band Music Hello, I Must Be Going! Phil Collins 0 0 0 Maxell Jazz II Sampler Various 0 0 0 Frank Sinatra's Greatest Hits Frank Sinatra 0 0 0 Sleeping Beauty Sun Ra And His Intergalactic Myth Science Solar Arkestra* 0 0 0 I Put A Spell On You Nina Simone 0 0 0 At The BBC Amy Winehouse 0 0 0 Making A Fire (Mark Ronson Re-Version) / Chasing Birds (Preservation Hall Jazz Band Re-Version) Foo Fighters 0 0 0 Related Styles of Music Swing Vocal Easy Listening Bop Contemporary Jazz Latin Jazz Dixieland Soundtrack Cool Jazz Jazz-Funk Ballad Soul-Jazz Theme Space-Age Post Bop",
    "political": "Can describe a recording of a political speech, political advertisements, propaganda, debates, or campaign promotions. Can be used for records containing propaganda songs, in conjunction with music styles such as Vocal, Neo-Romantic etc. Most Collected Political Music Explore More Popular Political Music No Sell Out Malcolm X 0 0 0 Keine Macht Für Niemand Ton Steine Scherben 0 0 0 Pete Seeger's Greatest Hits Pete Seeger 0 0 0 Here's To You / La Ballata Di Sacco E Vanzetti Joan Baez - Ennio Morricone 0 0 0 Dunkelgraue Lieder Ludwig Hirsch 0 0 0 John Fitzgerald Kennedy 1917-1963 (A Memorial Album) John F. Kennedy 0 0 0 Here's Johnny.... Magic Moments From The Tonight Show Johnny Carson 0 0 0 Political Artists Malcolm X 0 0 0 Mikis Theodorakis 0 0 0 Adolf Hitler 0 0 0 John F. Kennedy 0 0 0 Ernst Busch 0 0 0 Bertolt Brecht 0 0 0 Dr. Martin Luther King, Jr. 0 0 0 Early Political Releases Explore More Early Political Music The Right Of The People To Rule Theodore Roosevelt* 0 0 0 О Крестьянах-середняках / Что Такое Советская Власть В. И. Ленин* 0 0 0 Памяти Председ. Всер. Центр. Исп. Комит. Я. М. Свердлова / III-й Коммунистический Интернационал Ленин* 0 0 0 Roter Raketen-Marsch / Niggersong Kollektiv \"Rote Raketen\"* 0 0 0 Klucker And The Rain / Long Klucker W. R. Rhinehart 0 0 0 Доклад Тов. Сталина И. В. На Чрезвычайном VIII Всесоюзном Съезде Советов 25 Ноября 1936 Г. О Проекте Конституции Союза ССР И. В. Сталин* 0 0 0 中國國民黨黨歌 音樂 / 趙梅伯 0 0 0 Political Music Releases by Decade Top Submitters of Political Music Most Sold Political Releases This Month Explore More Trending Political Music No More Cocoons Jello Biafra 0 0 0 Herbstreise - Lieder Zur Lage Schmetterlinge 0 0 0 Proletenpassion Schmetterlinge 0 0 0 Here's Johnny.... Magic Moments From The Tonight Show Johnny Carson 0 0 0 Ραντεβού Με Την... Εισαγγελία Χάρρυ Κλυνν International* 0 0 0 Proletenpassion Schmetterlinge 0 0 0 Warum Geht Es Mir So Dreckig? Ton Steine Scherben 0 0 0 Related Styles of Music Spoken Word Speech Folk Comedy Poetry Ballad Marches Military Chanson Field Recording Education Dialogue Monolog Interview Experimental",
    "rhythm+&+blues": "Rhythmic style, derived from blues, which was highly influential on soul and a precursor to rock n roll. Releases employing the more recent, post-soul meaning of the term R&B come under the tags New Jack Swing or Contemporary R&B. Discogs prefers to specify one or the other now, as opposed to the less precise RnB/Swing tag.Rhythm and blues, often abbreviated as R&B, is a genre of popular music that originated in African-American communities in the 1940s. The term was originally used by record companies to describe recordings marketed predominantly to urban African American music. Most Collected Rhythm & Blues Music Explore More Popular Rhythm & Blues Music Blonde On Blonde Bob Dylan 0 0 0 Moondance Van Morrison 0 0 0 Aftermath The Rolling Stones 0 0 0 Back To Black Amy Winehouse 0 0 0 Hot Rocks 1964-1971 The Rolling Stones 0 0 0 Graceland Paul Simon 0 0 0 Songs In The Key Of Life Stevie Wonder 0 0 0 Rhythm & Blues Artists The Rolling Stones 0 0 0 Ray Charles 0 0 0 Ike & Tina Turner 0 0 0 Etta James 0 0 0 Bo Diddley 0 0 0 The Platters 0 0 0 Fats Domino 0 0 0 Early Rhythm & Blues Releases Explore More Early Rhythm & Blues Music Just A Kid Named Joe / Funiculi Funicula The Mills Brothers 0 0 0 Tutti-Frutti / Look-A-There Slim And Slam* 0 0 0 A Chicken Ain't Nothin' But A Bird Louis Jordan And His Tympany Five 0 0 0 Bounce The Ball (Do Da Dittle Um Day) / Don't Come Cryin' On My Shoulder Louis Jordan And His Tympany Five 0 0 0 Boogie Woogie's Ma-In-Law / Ever So Grateful Buddy Johnson And His Band* 0 0 0 Hiding All My Cares / Blue Lude In C Sharp Major The Four Clefs 0 0 0 Flat Fleet Floogee / Chinatown, My Chinatown Slim And Slam* 0 0 0 Rhythm & Blues Music Releases by Decade Top Submitters of Rhythm & Blues Music Most Sold Rhythm & Blues Releases This Month Explore More Trending Rhythm & Blues Music Picture Book Simply Red 0 0 0 Graceland Paul Simon 0 0 0 Why Don't You Go Home / Cocktail de Medianoche Diane Ward (3), The Kevin Fingier Collective 0 0 0 What's Going On Marvin Gaye 0 0 0 Blue Velvet (Original Motion Picture Soundtrack) Angelo Badalamenti 0 0 0 More Hot Rocks (Big Hits & Fazed Cookies) Rolling Stones* 0 0 0 Trees Of The Ages - Laura Nyro Live In Japan Laura Nyro 0 0 0 Related Styles of Music Soul Rock & Roll Doo Wop Funk Vocal Pop Rock Ballad Blues Rock Disco Beat Garage Rock Soul-Jazz Gospel Jump Blues Mod",
    "country+rock": "\"The typical country-rock song was an identifiable \"rock\" creation that used at least one element of standard country instrumentation, be it pedal steel or fiddle, kept the arrangement largely acoustic except for bass, and utilized countryish, Appalachian-style harmonies.\" Most Collected Country Rock Music Explore More Popular Country Rock Music Nashville Skyline Bob Dylan 0 0 0 Johnny Cash At San Quentin Johnny Cash 0 0 0 Harvest Neil Young 0 0 0 After The Gold Rush Neil Young 0 0 0 Déjà Vu Crosby, Stills, Nash & Young 0 0 0 Everybody Knows This Is Nowhere Neil Young With Crazy Horse 0 0 0 The Long Run Eagles 0 0 0 Country Rock Artists Johnny Cash 0 0 0 Neil Young 0 0 0 Jerry Lee Lewis 0 0 0 The Grateful Dead 0 0 0 Eagles 0 0 0 Poco (3) 0 0 0 The Marshall Tucker Band 0 0 0 Early Country Rock Releases Explore More Early Country Rock Music Kiss Me Big / Catfish Boogie Tennessee Ernie* With Cliffie Stone's Band 0 0 0 Tennessee Wig Walk / Hand-Me-Down Heart Bonnie Lou 0 0 0 Hot Rod Mama / Nicotine Fits Ramblin' Jimmie Dolan 0 0 0 I'll Sail My Ship Alone / It Had To Come Someday Ramblin' Jimmie Dolan 0 0 0 Favorites Hank Snow 0 0 0 Rotation Blues / Cowpoke Elton Britt And The Skytoppers 0 0 0 I'll Hate Myself Tomorrow / Wham! Bam! Thank You Mam! Ramblin' Jimmie Dolan 0 0 0 Country Rock Music Releases by Decade Top Submitters of Country Rock Music Most Sold Country Rock Releases This Month Explore More Trending Country Rock Music Déjà Vu Crosby, Stills, Nash & Young 0 0 0 Johnny Cash At San Quentin Johnny Cash 0 0 0 Lazaretto Jack White (2) 0 0 0 Texas Sun Khruangbin & Leon Bridges 0 0 0 Texas Moon Khruangbin & Leon Bridges 0 0 0 Texas Moon Khruangbin & Leon Bridges 0 0 0 Age Of Miracles Chuck Prophet 0 0 0 Related Styles of Music Folk Rock Country Pop Rock Alternative Rock Blues Rock Rock & Roll Indie Rock Classic Rock Folk Acoustic Psychedelic Rock Soft Rock Southern Rock Ballad Rockabilly",
    "garage+rock": "Raw, energetic and primal variety of rock and roll that flourished in the mid-1960s as many young people, inspired by The Beatles, decided to form bands. Precursor to psychedelic rock, garage rock is characterized by sometimes aggressive and unsophisticated lyrics and delivery, typically using guitars distorted through a fuzzbox.At the time there was no specific label and garage rock was not recognized as a separate genre, but critical recognition in the early 1970s through the release of the the Nuggets compilation albums did much to define and memorialize the style. The term derives from the perception the groups were young amateurs who rehearsed in their family garage, although many were professionals and never played in a garage at all. Most Collected Garage Rock Music Explore More Popular Garage Rock Music Elephant The White Stripes 0 0 0 The Velvet Underground & Nico The Velvet Underground & Nico (3) 0 0 0 Lust For Life Iggy Pop 0 0 0 Raw Power Iggy And The Stooges* 0 0 0 The Stooges The Stooges 0 0 0 Brothers The Black Keys 0 0 0 El Camino The Black Keys 0 0 0 Garage Rock Artists Iggy Pop 0 0 0 The Velvet Underground 0 0 0 The Stooges 0 0 0 The Cramps 0 0 0 Thee Headcoats 0 0 0 Ty Segall 0 0 0 Thee Oh Sees 0 0 0 Early Garage Rock Releases Explore More Early Garage Rock Music Tall Cool One The Wailers (2) 0 0 0 Square Rock Pt. III / Davey's Drag The Squares (5) 0 0 0 Transylvania / Amnesia The Mysterions (2) 0 0 0 Shanghied / Wailin' The Wailers (2) 0 0 0 Saxaphone Safari / Rock Me Gently The Tides (2) 0 0 0 Midnight Express /Frankie's Rock Willie Tremain's Thunderbirds 0 0 0 Show Down Tony March And Bill Davids Rockets 0 0 0 Garage Rock Music Releases by Decade Top Submitters of Garage Rock Music Most Sold Garage Rock Releases This Month Explore More Trending Garage Rock Music The Taxi Boys The Taxi Boys 0 0 0 Room On Fire The Strokes 0 0 0 Elephant The White Stripes 0 0 0 Halloween II - Live 2007 Roky Erickson & The Explosives 0 0 0 Frankie And The Witch Fingers Frankie And The Witch Fingers 0 0 0 Memphis In June Reigning Sound 0 0 0 Live at Jackpot Records Satan's Pilgrims 0 0 0 Related Styles of Music Punk Psychedelic Rock Rock & Roll Alternative Rock Indie Rock Beat Pop Rock Surf Lo-Fi Blues Rock Power Pop Folk Rock Mod Rhythm & Blues Hard Rock",
    "blues": "Blues was originated in the Deep South of the United States around the 1870s by African-Americans from roots in African musical traditions, African-American work songs, and spirituals. Blues incorporated spirituals, work songs, field hollers, shouts, chants, and rhymed simple narrative ballads. The blues form, ubiquitous in jazz, rhythm and blues and rock and roll, is characterized by the call-and-response pattern, the blues scale and specific chord progressions, of which the twelve-bar blues is the most common. Blue notes (or \"worried notes\"), usually thirds, fifths or sevenths flattened in pitch are also an essential part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect known as the groove.Delta blues is one of the earliest-known styles of blues. It originated in the Mississippi Delta, and is regarded as a regional variant of country blues. Guitar and harmonica are its dominant instruments; slide guitar is a hallmark of the style. Most Collected Blues Music Explore More Popular Blues Music Blonde On Blonde Bob Dylan 0 0 0 Let There Be Rock AC/DC 0 0 0 Are You Experienced The Jimi Hendrix Experience 0 0 0 Axis: Bold As Love The Jimi Hendrix Experience 0 0 0 Aftermath The Rolling Stones 0 0 0 Cosmo's Factory Creedence Clearwater Revival 0 0 0 Live At Leeds The Who 0 0 0 Blues Artists Eric Clapton 0 0 0 Ray Charles 0 0 0 B.B. King 0 0 0 Muddy Waters 0 0 0 John Lee Hooker 0 0 0 Lightnin' Hopkins 0 0 0 Fats Domino 0 0 0 Early Blues Releases Explore More Early Blues Music Bluin' The Blues / Sensation Rag Original Dixieland Jazz Band 0 0 0 The Road Is Rocky (But I Am Gonna Find My Way) / Fare The Honey Blues Mamie Smith And Her Jazz Hounds 0 0 0 Sweeter As The Years Go By / Since Jesus Came Into My Heart Homer Rodeheaver 0 0 0 Royal Garden Blues / Crazy Blues Mary Stafford And Her Jazz Band* 0 0 0 I Ain't Givin' Nothin' Away / Sweet Mama (Papa's Getting Mad) Southern Quartette* 0 0 0 That Thing Called Love / You Can't Keep A Good Man Down Mamie Smith 0 0 0 Blues Music Releases by Decade Top Submitters of Blues Music Most Sold Blues Releases This Month Explore More Trending Blues Music Are You Experienced The Jimi Hendrix Experience 0 0 0 MTV Unplugged In New York Nirvana 0 0 0 Are You Experienced The Jimi Hendrix Experience 0 0 0 Folk Singer Muddy Waters 0 0 0 Live In San  Diego '74 Rory Gallagher 0 0 0 Trees Of The Ages - Laura Nyro Live In Japan Laura Nyro 0 0 0 Cream Of The Crop 2003 Highlights The Allman Brothers Band 0 0 0 Related Styles of Music Rhythm & Blues Blues Rock Rock & Roll Country Blues Electric Blues Chicago Blues Soul Vocal Folk Pop Rock Psychedelic Rock Folk Rock Piano Blues Classic Rock Delta Blues",
    "psychedelic": "Music genre that emerged in the late 1960s in which soul musicians embraced elements of psychedelic rock, including its production techniques, instrumentation, effects units (fuzz, wah-wah, phaser, etc.), as well as drug influences. Most Collected Psychedelic Music Explore More Popular Psychedelic Music Merriweather Post Pavilion Animal Collective 0 0 0 Histoire De Melody Nelson Serge Gainsbourg 0 0 0 Stand! Sly & The Family Stone 0 0 0 Cold Fact Rodriguez* 0 0 0 Awaken, My Love! Childish Gambino 0 0 0 Con Todo El Mundo Khruangbin 0 0 0 Black Pumas Black Pumas 0 0 0 Psychedelic Artists Rotary Connection 0 0 0 The Temptations 0 0 0 Sly & The Family Stone 0 0 0 The Chambers Brothers 0 0 0 Los Destellos 0 0 0 Los Mirlos 0 0 0 Khruangbin 0 0 0 Early Psychedelic Releases Explore More Early Psychedelic Music Contact High With The Godz The Godz 0 0 0 Sensational Jimmy Gilmer And The Fireballs Jimmy Gilmer And The Fireballs 0 0 0 Space Walkin' The (Original) Spacemen* 0 0 0 Tema De Tracy Los Aragon* 0 0 0 Bare Footin' Alan Price Set* 0 0 0 Hereke / Silifke'nin Yoğurdu Cahit Oben Dörtlüsü 0 0 0 I Get Around The Andrew Oldham Orchestra* 0 0 0 Psychedelic Music Releases by Decade Top Submitters of Psychedelic Music Most Sold Psychedelic Releases This Month Explore More Trending Psychedelic Music Con Todo El Mundo Khruangbin 0 0 0 Cold Fact Rodriguez* 0 0 0 Texas Sun Khruangbin & Leon Bridges 0 0 0 Mordechai Khruangbin 0 0 0 Texas Moon Khruangbin & Leon Bridges 0 0 0 Texas Moon Khruangbin & Leon Bridges 0 0 0 Black Pumas Black Pumas 0 0 0 Related Styles of Music Funk Soul Experimental Jazz-Funk Disco Folk Psychedelic Rock Afrobeat Folk Rock Cumbia Soul-Jazz Pop Rock Soundtrack Easy Listening Downtempo",
    "romantic": "Compared to its predecessors, music from the romantic era is more fluid, emotional, personal, secular, and experimental. It was written more for middle-class audiences, and it heavily influenced film music throughout the 20th Century. Schubert, Schumann, Mendelssohn and Brahms represent the more conservative side of romanticism, and Berlioz, Strauss, Tchaikovsky, Wagner, Chopin, Debussy, and Holst represent the more experimental side. Most Collected Romantic Music Explore More Popular Romantic Music 9 Symphonien Beethoven* – Herbert von Karajan, Berliner Philharmoniker 0 0 0 Romanza Andrea Bocelli 0 0 0 2001: A Space Odyssey (Music From The Motion Picture Sound Track) Various 0 0 0 Walt Disney's Fantasia Leopold Stokowski With The Philadelphia Orchestra 0 0 0 In Concert Carreras*, Domingo*, Pavarotti*, Mehta* 0 0 0 Konzert Für Klavier Und Orchester Nr. 1 B-moll Sviatoslav Richter ∙ Herbert von Karajan, Tschaikowsky*, Wiener Symphoniker 0 0 0 Concerto No. 1 Tchaikovsky* / Van Cliburn, Kiril Kondrashin 0 0 0 Romantic Artists Ludwig van Beethoven 0 0 0 Frédéric Chopin 0 0 0 Antonín Dvořák 0 0 0 Franz Schubert 0 0 0 Johannes Brahms 0 0 0 Robert Schumann 0 0 0 Pyotr Ilyich Tchaikovsky 0 0 0 Early Romantic Releases Explore More Early Romantic Music Tosca: Vissi D'Arte S. Kruszelnicka* 0 0 0 Nocturne Mischa Elman 0 0 0 Забыты Нежныя Лобзанья/Резвился Ликующiй Миръ Варя Панина 0 0 0 Feuerzauber Alfred Grünfeld 0 0 0 Santiago Waltz Dance Orchestra* 0 0 0 Chimes Of Normandy Selection Arthur Pryor's Band 0 0 0 Romantic Music Releases by Decade Top Submitters of Romantic Music Most Sold Romantic Releases This Month Explore More Trending Romantic Music Hooked On Classics Louis Clark Conducting The Royal Philharmonic Orchestra 0 0 0 Klavierkonzert = Piano Concerto No.2 Brahms* – Maurizio Pollini · Claudio Abbado - Wiener Philharmoniker · Vienna Philharmonic* 0 0 0 Horowitz Horowitz* 0 0 0 Horowitz In Moscow Horowitz* 0 0 0 Symphonie No. 1 Mahler* - Chicago Symphony Orchestra* / Claudio Abbado 0 0 0 Two Rhapsodies, Op. 79 · Piano Pieces · Klavierstücke Opp. 117-119 Brahms* - Radu Lupu 0 0 0 Symphony No. 1 Op. 68 Brahms*, Los Angeles Philharmonic Orchestra / Carlo Maria Giulini 0 0 0 Related Styles of Music Classical Modern Opera Baroque Impressionist Contemporary Vocal Easy Listening Choral Neo-Romantic Ballad Neo-Classical Operetta Renaissance Folk",
    "public+broadcast": "\"Public Broadcast\" is a style under Non-Music, mainly with voice-overs, ads, track mixing, etc.Be careful with releases made for distribution to AFRTS (American Forces Radio and Television Service) stations: 'Transcription' covers the licensing end of the release. It's like the Promo format tag. 'Public Broadcast' covers the content end. It is a semi-meta style in which the recording can contain music, PSA's, promotional material, interviews, and interstitial announcer spoken word sequenced for contiguous broadcast (or a recording of such).Some releases are both, some releases are either or neither. There's definite overlap. The modern equivalent would be a (downloadable) podcast, which Staff has okayed for use under this tag. Most Collected Public Broadcast Music Explore More Popular Public Broadcast Music Manhattan Research Inc. Raymond Scott 0 0 0 Superstar Concert Series Talking Heads 0 0 0 Superstar Concert Series R.E.M. 0 0 0 In Concert-305 Led Zeppelin 0 0 0 Stereo Pop Special-3 Pink Floyd 0 0 0 In Concert-215 AC/DC 0 0 0 Supergroups David Bowie 0 0 0 Public Broadcast Artists David Bowie 0 0 0 The Cure 0 0 0 Santana 0 0 0 INXS 0 0 0 The Allman Brothers Band 0 0 0 John Cougar Mellencamp 0 0 0 Mary Turner (4) 0 0 0 Early Public Broadcast Releases Explore More Early Public Broadcast Music Jacko, The Broadcasting Kookaburra Dr. E. Brooke Nicholls 0 0 0 Bernard Shaw Speaks George Bernard Shaw 0 0 0 Empire Day Messages To The Boys and Girls of The British Empire, from His Majesty King George The Fifth and Her Majesty Queen Mary Recorded at Buckingham Palace King George V, Queen Mary (6) 0 0 0 Le Pape Vous Parle En Français Jean XXIII* 0 0 0 On The Death Of King George Laurence Olivier 0 0 0 Brasil Campeão Do Mundo Equipe Esportiva Da Rádio Bandeirantes, Côro E Orquestra Columbia* 0 0 0 President Roosevelt's Address To The Congress Of The United States President Roosevelt* 0 0 0 Public Broadcast Music Releases by Decade Top Submitters of Public Broadcast Music Most Sold Public Broadcast Releases This Month Explore More Trending Public Broadcast Music Manhattan Research Inc. Raymond Scott 0 0 0 RCA Special Radio Series XIII Daryl Hall & John Oates 0 0 0 The Color Purple - The Interview With Quincy Jones Quincy Jones 0 0 0 In Concert-381 Prefab Sprout 0 0 0 En 1973 Nous Avons Vécu Cela No Artist 0 0 0 The Ricky Skaggs Story - Radio Special Ricky Skaggs 0 0 0 Casey's Top 40 With Casey Kasem Various 0 0 0 Related Styles of Music Interview Classic Rock New Wave Spoken Word Comedy Radioplay Pop Rock Hard Rock Education Prog Rock Speech Synth-pop Blues Rock Political Alternative Rock",
    "avantgarde": "Avant-garde music is music that is considered to be at the forefront of experimentation or innovation in its field. Most Collected Avantgarde Music Explore More Popular Avantgarde Music Goo Sonic Youth 0 0 0 Daydream Nation Sonic Youth 0 0 0 Brain Salad Surgery Emerson, Lake & Palmer 0 0 0 Lodger David Bowie 0 0 0 White Light/White Heat The Velvet Underground 0 0 0 Hot Rats Frank Zappa 0 0 0 My Beautiful Dark Twisted Fantasy Kanye West 0 0 0 Avantgarde Artists The Residents 0 0 0 The Legendary Pink Dots 0 0 0 The Velvet Underground 0 0 0 Buckethead 0 0 0 Frank Zappa 0 0 0 Captain Beefheart 0 0 0 The Mothers 0 0 0 Early Avantgarde Releases Explore More Early Avantgarde Music Pastoral Suite / Surf Session Moondog (2) & Suzuko 0 0 0 音楽詩劇 「オンディーヌ」 = Ondine 三善晃* 0 0 0 The Piano Music Of Henry Cowell Henry Cowell 0 0 0 Aniara - An Epic Of Space Flight In 2038 A.D. Karl-Birger Blomdahl 0 0 0 Ionisation (For Percussion Ensemble) Edgar Varèse* 0 0 0 Who Tore Your Trousers Ivor Cutler 0 0 0 Musique Phénoménale Asger Jorn & Jean Dubuffet 0 0 0 Avantgarde Music Releases by Decade Top Submitters of Avantgarde Music Most Sold Avantgarde Releases This Month Explore More Trending Avantgarde Music Hounds Of Love Kate Bush 0 0 0 My Beautiful Dark Twisted Fantasy Kanye West 0 0 0 Daydream Nation Sonic Youth 0 0 0 My Beautiful Dark Twisted Fantasy Kanye West 0 0 0 Low David Bowie 0 0 0 Art Angels Grimes (4) 0 0 0 Camera Obscura Nico (3) + The Faction* 0 0 0 Related Styles of Music Experimental Art Rock Noise Alternative Rock Psychedelic Rock Prog Rock Black Metal Abstract Ambient Punk Indie Rock Industrial New Wave Free Improvisation Lo-Fi",
    "folk": "In a nutshell, Folk music is \"local music from out there\" or \"someone else's local music\".Contemporary Folk refers to post-Bob Dylan folk singer/songwriters of the 70s and beyond. Prior to Dylan, most folk performers interpreted classic folk songs or wrote broad-based, topical songs. Most Collected Folk Music Explore More Popular Folk Music Bringing It All Back Home Bob Dylan 0 0 0 Songs Of Leonard Cohen Leonard Cohen 0 0 0 The Times They Are A-Changin' Bob Dylan 0 0 0 The Freewheelin' Bob Dylan Bob Dylan 0 0 0 Bob Dylan's Greatest Hits Bob Dylan 0 0 0 American Pie Don McLean 0 0 0 Folklore Taylor Swift 0 0 0 Folk Artists Bob Dylan 0 0 0 Pete Seeger 0 0 0 Joan Baez 0 0 0 Burl Ives 0 0 0 Kingston Trio 0 0 0 Gheorghe Zamfir 0 0 0 Južni Vetar 0 0 0 Early Folk Releases Explore More Early Folk Music Carry Me Back To Tennessee / Massa's In The Cold Cold Ground Carroll Clark* 0 0 0 Turkey In The Straw Billy Golden 0 0 0 Old Folks At Home Emma Calvé 0 0 0 He Was Very Kind To Me / I Love A Lassie Sandy Shaw (2) 0 0 0 Norsk Bondebryllup Herr Adolf Østbye* Og Herr P. Pedersen* 0 0 0 Колокольчики / Дремлютъ Плакучiя Ивы М. А. Каринская* 0 0 0 Jigs And Reels Medley / Maple Leaf Rag Walter Biedermann / Vess Ossman* 0 0 0 Folk Music Releases by Decade Top Submitters of Folk Music Most Sold Folk Releases This Month Explore More Trending Folk Music Punisher Phoebe Bridgers 0 0 0 Foolish Seasons Dana Gillespie 0 0 0 Gold Dust - Live At The Royalty Sandy Denny 0 0 0 Shuckin' Sugar Karen Dalton 0 0 0 Blue Highlights Joni Mitchell 0 0 0 The Innocents Weyes Blood 0 0 0 Abbey Road Lonely John Craigie 0 0 0 Related Styles of Music Country Folk Rock Vocal Acoustic Celtic Ballad Experimental Chanson Indie Rock Schlager Pop Rock Bluegrass Psychedelic Rock Ambient Religious",
    "experimental": "Experimental music consciously deviates from established musical norms (of a particular genre, or of music in general). Music of almost any genre can be considered experimental – but the term is often associated with the more abstract and challenging strains of electronic music, jazz, and rock. Avantgarde has its own tag.Experimental music might explore new compositional techniques (e.g., John Cage's use of the I Ching, or Steve Reich's process music), new musical forms (but drone and free improvisation have their own tags), unusual instruments (e.g., the theremin, or Harry Partch's homemade instruments), extramusical sounds (e.g., Matmos, but musique concrète has its own tag), \"extended technique\" (playing instruments in unusual ways – e.g., Cage's prepared piano), microtonal scales, minimalism (e.g., lowercase music), unexpected stylistic fusions, abrasive timbres and rhythms, or experiments in any other aspect of music.As such, \"experimental music\" isn't really a single style with a distinct sound. It's more of a sensibility: an effort to explore new musical frontiers, and to expand the boundaries of musical experience.There is major potential for overuse of this tag, which can be thinned out via use of the various others mentioned on this page instead. Most Collected Experimental Music Explore More Popular Experimental Music The Piper At The Gates Of Dawn Pink Floyd 0 0 0 Ummagumma Pink Floyd 0 0 0 Kid A Radiohead 0 0 0 In Rainbows Radiohead 0 0 0 \"Heroes\" David Bowie 0 0 0 The Velvet Underground & Nico The Velvet Underground & Nico (3) 0 0 0 The Beatles The Beatles 0 0 0 Experimental Artists Muslimgauze 0 0 0 Björk 0 0 0 The Residents 0 0 0 Nurse With Wound 0 0 0 The Legendary Pink Dots 0 0 0 Kevin Drumm 0 0 0 Buckethead 0 0 0 Early Experimental Releases Explore More Early Experimental Music Radio Programme No.1: Henry Jacobs' \"Music & Folklore\" Henry Jacobs 0 0 0 The Sounds And Music Of The RCA Electronic Music Synthesizer Various 0 0 0 Moondog And His Friends Moondog (2) 0 0 0 Music For Peace Of Mind Dr. Samuel J. Hoffman 0 0 0 Tape Recorder Music Otto Luening / Vladimir Ussachevsky 0 0 0 Music Out Of The Moon / Music For Peace Of Mind Theremin With Vocal Group And Orchestra, Harry Revel & Leslie Baxter* & Dr. Samuel J. Hoffman 0 0 0 Vox Humana: Alfred Wolfsohn's Experiments In Extension Of Human Vocal Range Alfred Wolfsohn 0 0 0 Experimental Music Releases by Decade Top Submitters of Experimental Music Most Sold Experimental Releases This Month Explore More Trending Experimental Music Gorillaz Gorillaz 0 0 0 An Awesome Wave Alt-J 0 0 0 Selected Ambient Works 85-92 Aphex Twin 0 0 0 Ants From Up There Black Country, New Road 0 0 0 ZABA Glass Animals 0 0 0 Bustin' + Dronin' Blur 0 0 0 Forest Nocturne The Lord (2) 0 0 0 Related Styles of Music Ambient Abstract Noise Industrial Drone Techno Avantgarde IDM Dark Ambient Minimal Electro Downtempo Psychedelic Rock Alternative Rock Synth-pop",
    "psychedelic+rock": "Psychedelic rock is a style of rock music that is inspired or influenced by psychedelic culture and attempts to replicate and enhance the mind-altering experiences of psychedelic drugs. It often uses new recording techniques and effects and draws on non-Western sources such as the ragas and drones of Indian music. Most Collected Psychedelic Rock Music Explore More Popular Psychedelic Rock Music The Dark Side Of The Moon Pink Floyd 0 0 0 Meddle Pink Floyd 0 0 0 Sgt. Pepper's Lonely Hearts Club Band The Beatles 0 0 0 1967-1970 The Beatles 0 0 0 Are You Experienced The Jimi Hendrix Experience 0 0 0 Revolver The Beatles 0 0 0 The Doors The Doors 0 0 0 Psychedelic Rock Artists Pink Floyd 0 0 0 The Doors 0 0 0 Jefferson Airplane 0 0 0 The Beatles 0 0 0 Jimi Hendrix 0 0 0 The Grateful Dead 0 0 0 The Jimi Hendrix Experience 0 0 0 Early Psychedelic Rock Releases Explore More Early Psychedelic Rock Music The Original Telstar - The Sounds Of The Tornadoes The Tornadoes* 0 0 0 Cleopatra's Needle Ahab And The Wailers 0 0 0 San Francisco Bay Burr Bailey And The Six Shooters* 0 0 0 Flamenco / Es Como Un Sueño Los Brincos 0 0 0 Blues On The Rocks / Snake Hips The Johnny Lewis Trio And Millie (4) 0 0 0 I Hear A New World (Part 1) Joe Meek 0 0 0 Just Let Her Go / It's Not Like You Ivan And The Sabers* 0 0 0 Psychedelic Rock Music Releases by Decade Top Submitters of Psychedelic Rock Music Most Sold Psychedelic Rock Releases This Month Explore More Trending Psychedelic Rock Music The Dark Side Of The Moon Pink Floyd 0 0 0 Maggot Brain Funkadelic 0 0 0 So Tonight That I Might See Mazzy Star 0 0 0 More Hot Rocks (Big Hits & Fazed Cookies) Rolling Stones* 0 0 0 Wembley Empire Pool, London, England 4/8/72 The Grateful Dead 0 0 0 L.A. Woman Sessions Doors* 0 0 0 Frankie And The Witch Fingers Frankie And The Witch Fingers 0 0 0 Related Styles of Music Garage Rock Prog Rock Pop Rock Experimental Folk Rock Blues Rock Indie Rock Alternative Rock Stoner Rock Space Rock Hard Rock Classic Rock Krautrock Beat Acid Rock",
    "modern+classical": "On Discogs, this is used for music that emphasizes traditional orchestral instruments, but that has an electronic component, such as tape loops, samples, noticable effects, drum machines, and so on. It is sometimes also used for things like string quartet or brass band covers of electronic music, even though the music itself isn't electronic.Better not to be used for academic composers, for whom you should use Musique concrète, Avantgarde, Contemporary (genre: Classical), etc, as appropriate. Most Collected Modern Classical Music Explore More Popular Modern Classical Music Chariots Of Fire Vangelis 0 0 0 Hergest Ridge Mike Oldfield 0 0 0 We're Only In It For The Money The Mothers Of Invention* 0 0 0 Journey To The Centre Of The Earth Rick Wakeman 0 0 0 Switched-On Bach Walter Carlos 0 0 0 Stanley Kubrick's A Clockwork Orange (Music From The Soundtrack) Various 0 0 0 Ghostbusters (Original Soundtrack Album) Various 0 0 0 Modern Classical Artists Enya 0 0 0 Dead Can Dance 0 0 0 Philip Glass 0 0 0 In The Nursery 0 0 0 Rondò Veneziano 0 0 0 Christopher Young 0 0 0 Yanni (2) 0 0 0 Early Modern Classical Releases Explore More Early Modern Classical Music Snaketime Series Moondog (2) 0 0 0 More Moondog Moondog (2) 0 0 0 A Poem In Cycles And Bells & Other Music For Tape Recorder Luening* / Ussachevsky* / William Bergsma 0 0 0 The Story Of Moondog Moondog (2) 0 0 0 Moondog And His Friends Moondog (2) 0 0 0 Spellbound Heindorf* 0 0 0 Ballet Suite No. 1, Opus 84 / The Comedians, Opus 26 / Love For Three Oranges Suite, Opus 33A / Girl's Dance And Polovtsian Dances From Prince Igor Shostakovitch*, Kabalevsky*, Prokofieff*, Borodin* - Adolf Fritz Guhl, Arthur Rother*, Karl Rucht, Berlin Symphony Choir*, Berlin Symphony Orchestra* 0 0 0 Modern Classical Music Releases by Decade Top Submitters of Modern Classical Music Most Sold Modern Classical Releases This Month Explore More Trending Modern Classical Music Shepherd Moons Enya 0 0 0 Interstellar (Original Motion Picture Soundtrack) Hans Zimmer 0 0 0 Esja Hania Rani 0 0 0 Absent Origin Mira Calix 0 0 0 The Pavilion Of Dreams Harold Budd 0 0 0 Consumed In Key Plastikman & Chilly Gonzales* 0 0 0 Hook (Original Motion Picture Soundtrack) John Williams (4) 0 0 0 Related Styles of Music Ambient Experimental Soundtrack Score Abstract Downtempo Minimal Dark Ambient Drone Industrial Contemporary New Age Synth-pop Dungeon Synth Neofolk",
    "theme": "The main theme or signature song from a motion picture, television program, video game or musical. Most Collected Theme Music Explore More Popular Theme Music The Turn Of A Friendly Card The Alan Parsons Project 0 0 0 Illinois Sufjan Stevens 0 0 0 One Night In Bangkok Murray Head 0 0 0 Eye Of The Tiger Survivor 0 0 0 Back To The Future (Music From The Motion Picture Soundtrack) Various 0 0 0 Miami Vice (Music From The Television Series) Various 0 0 0 I Just Called To Say I Love You Stevie Wonder 0 0 0 Theme Artists Henry Mancini 0 0 0 Ennio Morricone 0 0 0 John Barry 0 0 0 Ferrante & Teicher 0 0 0 Henry Mancini And His Orchestra 0 0 0 Mantovani And His Orchestra 0 0 0 Cristina D'Avena 0 0 0 Early Theme Releases Explore More Early Theme Music There's A Rainbow 'Round My Shoulder / Sonny Boy Al Jolson 0 0 0 You’re Always In My Arms (But Only In My Dreams) / If You’re In Love, You’ll Waltz Bebe Daniels 0 0 0 Blue Hawaii / Louise Paul Whiteman And His Orchestra 0 0 0 Walking With Susie / Breakaway Milt Shaw And His Orchestra 0 0 0 Den Store, Hvide Flok / Glade Jul, Dejlige Jul Carsten Woll* 0 0 0 My Tonia / My Inspiration Is You Arnold Johnson And His Paramount Hotel Orchestra* 0 0 0 Aubade Printanniére / Die Lorelei Ferdy Kauffman Und Sein Orchester 0 0 0 Theme Music Releases by Decade Top Submitters of Theme Music Most Sold Theme Releases This Month Explore More Trending Theme Music Miami Vice (Music From The Television Series) Various 0 0 0 Spoon Can 0 0 0 Irwin Allen's Lost In Space - Title Themes From The Hit TV Series Various 0 0 0 No Time To Die Billie Eilish 0 0 0 No Time To Die Billie Eilish 0 0 0 High Scores From The Golden Age Of 8-Bit Gaming Various 0 0 0 Una Pistola Per Ringo / Il Ritorno Di Ringo (Colonne Sonore Originali Dei Film) Ennio Morricone 0 0 0 Related Styles of Music Soundtrack Easy Listening Score Vocal Ballad Pop Rock Disco Chanson Synth-pop Musical Big Band Funk Jazz-Funk Instrumental Soul",
    "contemporary+jazz": "Contemporary Jazz is essentially a catch-all term for the various permutations of popular, mainstream jazz of the 1980s and '90s. While those years were certainly not devoid of complex, cerebral jazz recordings, music referred to as contemporary jazz does not usually share those sensibilities, nor is the term generally used to describe music centered around hard bop or the avant-garde. Instead, instrumental contemporary jazz is usually informed by some combination of a) fusion -- often slickly produced, with an emphasis on rock and funk rhythms; b) pop-jazz, with its almost exclusive concentration on memorable melodies; c) smooth jazz, with its primary goal of creating pleasant, mellow textures; and d) crossover jazz and contemporary funk, with their blend of polished production and R&B influences. Not all contemporary jazz artists completely discard improvisation and challenging experimentation, but by and large, most instrumentalists emphasize shiny production, melody, and accessibility. In the realm of vocal jazz, artists may or may not possess an improvisational flair, but in most cases, their recordings attempt to evoke an aura of stylish sophistication, sometimes drawing upon pop and R&B in addition to jazz. Taken from Allmusic.com style page. Most Collected Contemporary Jazz Music Explore More Popular Contemporary Jazz Music The Heart Of Saturday Night Tom Waits 0 0 0 Small Change Tom Waits 0 0 0 Moondance Van Morrison 0 0 0 The Hissing Of Summer Lawns Joni Mitchell 0 0 0 Give Me The Night George Benson 0 0 0 Come Away With Me Norah Jones 0 0 0 Feels Like Home Norah Jones 0 0 0 Contemporary Jazz Artists Ennio Morricone 0 0 0 Pat Metheny 0 0 0 Bill Frisell 0 0 0 Keith Jarrett 0 0 0 Anthony Braxton 0 0 0 Jack DeJohnette 0 0 0 Charlie Haden 0 0 0 Early Contemporary Jazz Releases Explore More Early Contemporary Jazz Music Ahmad Jamal At The Pershing Ahmad Jamal Trio 0 0 0 I Like Jazz! Various 0 0 0 Dancing On The Ceiling With The Red Norvo Trio Red Norvo Trio* 0 0 0 Parisian Thoroughfare Ronnie Scott Orchestra* 0 0 0 Lullaby Of The Leaves Tony Kinsey Quartet* 0 0 0 L'Uomo Del Braccio D'Oro Nino Impallomeni E Il Suo Sestetto 0 0 0 Contemporary Jazz Music Releases by Decade Top Submitters of Contemporary Jazz Music Most Sold Contemporary Jazz Releases This Month Explore More Trending Contemporary Jazz Music Kokoroko Kokoroko 0 0 0 To Cy & Lee: Instrumentals Vol. 1 Alabaster DePlume 0 0 0 We Are Jon Batiste* 0 0 0 Space 1.8 Nala Sinephro 0 0 0 Black Acid Soul Lady Blackbird 0 0 0 Call Me Ayako Hosokawa With T. Miyama & The New Herd* 0 0 0 Nujabes Pray Reflections Haruka Nakamura 0 0 0 Related Styles of Music Fusion Free Jazz Post Bop Free Improvisation Smooth Jazz Jazz-Funk Easy Listening Soul-Jazz Avant-garde Jazz Vocal Big Band Cool Jazz Jazz-Rock Experimental Latin Jazz",
    "soundtrack": "Music accompanying, featured in or inspired by a motion picture, television program or video game. Most Collected Soundtrack Music Explore More Popular Soundtrack Music The Soundtrack From The Film The Song Remains The Same Led Zeppelin 0 0 0 Purple Rain Prince And The Revolution 0 0 0 Pulp Fiction (Music From The Motion Picture) Various 0 0 0 Saturday Night Fever (The Original Movie Sound Track) Various 0 0 0 A Hard Day's Night The Beatles 0 0 0 Help! The Beatles 0 0 0 Grease (The Original Soundtrack From The Motion Picture) Various 0 0 0 Soundtrack Artists Ennio Morricone 0 0 0 Shankar-Jaikishan 0 0 0 Anu Malik 0 0 0 R. D. Burman 0 0 0 Laxmikant-Pyarelal 0 0 0 Anand Bakshi 0 0 0 Sameer 0 0 0 Early Soundtrack Releases Explore More Early Soundtrack Music Ramona / Girl Of My Dreams Gene Austin 0 0 0 Fantasie Uit \"De Groote Parade\" Pierre Palla 0 0 0 Les Ananas / Valentine Maurice Chevalier 0 0 0 Sweet Lady / Say It With Music Lanin's Famous Players* 0 0 0 Indian Love Call / Rose-Marie Olive Kline / Lambert Murphy 0 0 0 I'm Bringing A Red - Red Rose / Love Me Or Leave Me Ruth Etting 0 0 0 Gotta Feelin' For You / Low Down Rhythm The Seven Hot Air-Men 0 0 0 Soundtrack Music Releases by Decade Top Submitters of Soundtrack Music Most Sold Soundtrack Releases This Month Explore More Trending Soundtrack Music Purple Rain Prince And The Revolution 0 0 0 Blade Runner Vangelis 0 0 0 Call Me By Your Name (Original Motion Picture Soundtrack) Various 0 0 0 Lost In Translation (Music From The Motion Picture Soundtrack) Various 0 0 0 Breakin': Original Motion Picture Soundtrack Various 0 0 0 Blue Velvet (Original Motion Picture Soundtrack) Angelo Badalamenti 0 0 0 Die Sendung Mit Der Maus Hans Posegga, Flughand ft. Steichi 0 0 0 Related Styles of Music Score Bollywood Theme Hindustani Vocal Pop Rock Ambient Easy Listening Musical Video Game Music Experimental Synth-pop Ballad Modern Classical Disco",
    "score": "A score is original music written specifically to accompany a dramatic presentation, such as a movie, television program, play, or video game. In the case of a medium recorded on film or video, the written score may be recorded and used as part of the soundtrack, which also includes dialogue and/or sound effects. Alternatively, the written score may be re-recorded for release to the public, so that the released recording is separate from the soundtrack. For example, John Williams's Star Wars is a score used as a film soundtrack. Franz Waxman's The Bride Of Frankenstein is a newly recorded version of the original score, and is not a film soundtrack. Cecil Payne's The Connection was written as the score for a play. Most Collected Score Music Explore More Popular Score Music Soundtrack From Twin Peaks Angelo Badalamenti 0 0 0 Chariots Of Fire Vangelis 0 0 0 Blade Runner Vangelis 0 0 0 Star Wars John Williams (4), The London Symphony Orchestra 0 0 0 Yellow Submarine The Beatles 0 0 0 Super Fly (The Original Motion Picture Soundtrack) Curtis Mayfield 0 0 0 TRON: Legacy (Original Motion Picture Soundtrack) Daft Punk 0 0 0 Score Artists Ennio Morricone 0 0 0 James Horner 0 0 0 Hans Zimmer 0 0 0 Danny Elfman 0 0 0 Jerry Goldsmith 0 0 0 James Newton Howard 0 0 0 John Williams (4) 0 0 0 Early Score Releases Explore More Early Score Music You Will Remember Vienna / I Bring A Love Song Richard Crooks (2) 0 0 0 Auch Du Wirst Mich Einmal Betrügen / In Wien, Wo Der Wein Und Der Walzer Blüth Irene Eisinger 0 0 0 Christels Lied / Heurigen-Lied Lilian Harvey / Willy Fritsch 0 0 0 If I'm Dreaming / Sunny Side Up The Clevelanders 0 0 0 Im Salzkammergut, Da Kann Man Lustig Sein / Im Weißen Rössl Am Wolfgangsee Odeon-Tanz-Orchester* 0 0 0 Pagan Love Song/ My Song Of The Nile The Hawaiian Islanders 0 0 0 Ol' Man River / A Room With A View Ciro's Club Dance Band 0 0 0 Score Music Releases by Decade Top Submitters of Score Music Most Sold Score Releases This Month Explore More Trending Score Music Music From Twin Peaks Angelo Badalamenti 0 0 0 Interstellar (Original Motion Picture Soundtrack) Hans Zimmer 0 0 0 Blade Runner Vangelis 0 0 0 Cowboy Bebop (Original Series Soundtrack) Seatbelts* 0 0 0 Eternal Sunshine Of The Spotless Mind (Original Soundtrack) Jon Brion, Various 0 0 0 La Dama Rossa Uccide 7 Volte (Colonna Sonora Originale) Bruno Nicolai 0 0 0 Una Pistola Per Ringo / Il Ritorno Di Ringo (Colonne Sonore Originali Dei Film) Ennio Morricone 0 0 0 Related Styles of Music Soundtrack Theme Modern Classical Contemporary Ambient Easy Listening Video Game Music Experimental Musical Vocal Modern Classical Pop Rock Downtempo Synth-pop",
    "space+rock": "Space Rock is a style that evolved out of psychedelic and progressive rock music. The style is known for having lyrics related to Space and Sci-Fi topics. It's also known for having spacey effects in their music. Most Collected Space Rock Music Explore More Popular Space Rock Music Black Holes & Revelations Muse 0 0 0 X In Search Of Space Hawkwind 0 0 0 Space Ritual Hawkwind 0 0 0 Ladies And Gentlemen We Are Floating In Space Spiritualized®* 0 0 0 Strangers In The Night UFO (5) 0 0 0 Love Missile F1-11 Sigue Sigue Sputnik 0 0 0 The Resistance Muse 0 0 0 Space Rock Artists Ozric Tentacles 0 0 0 Pink Floyd 0 0 0 Hawkwind 0 0 0 Rockets 0 0 0 White Hills 0 0 0 Sendelica 0 0 0 Øresund Space Collective 0 0 0 Early Space Rock Releases Explore More Early Space Rock Music (The) Ventures In Space The Ventures 0 0 0 The Big Guitar Sound Living Guitars 0 0 0 Out Of Limits The Marketts 0 0 0 Ritchie Valens & Jerry Kole Ritchie Valens And Jerry Kole* 0 0 0 Scratch / Charge The Camelots (2) 0 0 0 Play Telstar And Lonely Bull The Ventures 0 0 0 The Face From Outer Space / Lonely Lips Jeff Barry 0 0 0 Space Rock Music Releases by Decade Top Submitters of Space Rock Music Most Sold Space Rock Releases This Month Explore More Trending Space Rock Music Sweet Heart, Sweet Light Spiritualized?* 0 0 0 Nonagon Infinity King Gizzard And The Lizard Wizard 0 0 0 Ladies And Gentlemen We Are Floating In Space Spiritualized®* 0 0 0 Ladies And Gentlemen We Are Floating In Space Spiritualized®* 0 0 0 Dissolution Wave Cloakroom 0 0 0 Everything Was Beautiful™ Spiritualized®* 0 0 0 Bufo Alvarius Bardo Pond 0 0 0 Related Styles of Music Psychedelic Rock Prog Rock Experimental Stoner Rock Krautrock Ambient Alternative Rock Indie Rock Shoegaze Post Rock Hard Rock Avantgarde Noise Art Rock Doom Metal",
    "pop": "Pop music (a term that originally derives from an abbreviation of \"popular\") is a genre of popular music, which originated in its modern form in the 1950s, deriving from rock and roll. The terms \"popular music\" and \"pop music\" are often used interchangeably, even though the former is a description of music which is popular (and can include any style).On Discogs, the Pop genre \"can and should be used with any other genre to tag items as being mainstream, chart orientated works.\" Most Collected Pop Music Explore More Popular Pop Music Greatest Hits Queen 0 0 0 Thriller Michael Jackson 0 0 0 Purple Rain Prince And The Revolution 0 0 0 1962-1966 The Beatles 0 0 0 Sgt. Pepper's Lonely Hearts Club Band The Beatles 0 0 0 Bridge Over Troubled Water Simon and Garfunkel* 0 0 0 Rubber Soul The Beatles 0 0 0 Pop Artists Elvis Presley 0 0 0 Frank Sinatra 0 0 0 The Beatles 0 0 0 Dalida 0 0 0 Bing Crosby 0 0 0 Nana Mouskouri 0 0 0 Charles Aznavour 0 0 0 Early Pop Releases Explore More Early Pop Music Thoughts Of Home Polka Issler's Orchestra 0 0 0 The Laughing Song George W. Johnson 0 0 0 Whistling Mike Jno Terrell* 0 0 0 Put Me Off At Buffalo Mr. John Terrell* 0 0 0 In The Shadow Of The Pines Macdonough* & Madeira* 0 0 0 The Holy City J. W. Myers 0 0 0 Old Black Joe Haydn Quartet 0 0 0 Pop Music Releases by Decade Top Submitters of Pop Music Most Sold Pop Releases This Month Explore More Trending Pop Music The Lakes Taylor Swift 0 0 0 Northern Star Melanie C 0 0 0 #1's Mariah* 0 0 0 Brilliant Adventure EP David Bowie 0 0 0 Little Voice Sara Bareilles 0 0 0 Who's That Girl (Super Club Mix) Madonna 0 0 0 Altered Reels Frankie Goes To Hollywood 0 0 0 Related Styles of Music Vocal Pop Rock Chanson Ballad Schlager Synth-pop Europop Easy Listening Disco Indie Pop Rock & Roll Indie Rock Soul Folk Soft Rock",
    "folk+rock": "Folk rock is a musical genre combining elements of folk music and rock music. In its earliest and narrowest sense, the term referred to a genre that arose in the United States and the UK around the mid-1960s. The genre was pioneered by the Los Angeles band The Byrds, who began playing traditional folk music and Bob Dylan-penned material with rock instrumentation, in a style heavily influenced by The Beatles and other British bands. The term \"folk rock\" was itself first coined by the U.S. music press to describe The Byrds' music in June 1965, the same month that the band's debut album was issued. The release of The Byrds' cover version of Dylan's \"Mr. Tambourine Man\" and its subsequent commercial success initiated the folk rock explosion of the mid-1960s. Dylan himself was also influential on the genre, particularly his recordings with an electric rock band on the Bringing It All Back Home, Highway 61 Revisited, and Blonde on Blonde albums. Dylan's 25 July 1965 appearance at the Newport Folk Festival with an electric backing band is also considered a pivotal moment in the development of folk rock. Most Collected Folk Rock Music Explore More Popular Folk Rock Music The River Bruce Springsteen 0 0 0 Bridge Over Troubled Water Simon and Garfunkel* 0 0 0 Simon And Garfunkel's Greatest Hits Simon & Garfunkel 0 0 0 Harvest Neil Young 0 0 0 After The Gold Rush Neil Young 0 0 0 Déjà Vu Crosby, Stills, Nash & Young 0 0 0 Graceland Paul Simon 0 0 0 Folk Rock Artists Bob Dylan 0 0 0 Neil Young 0 0 0 Donovan 0 0 0 The Byrds 0 0 0 The Mamas & The Papas 0 0 0 Simon & Garfunkel 0 0 0 The Grateful Dead 0 0 0 Early Folk Rock Releases Explore More Early Folk Rock Music The Kingston Trio The Kingston Trio* 0 0 0 (It's Been A Long Time) Pretty Baby / Love's A Carousel Gino & Gina 0 0 0 England's 14-Year Old Singing Sensation Laurie London 0 0 0 Swingin' On A Rainbow Frankie Avalon 0 0 0 Soul Of Music U.S.A. 101 Strings 0 0 0 Wabash Cannon Ball / You Don't Have To Be From The Country Dizzy Dean And His Country Cousins 0 0 0 Music Drives Me Crazy / Dixieland Roll Martha Carson 0 0 0 Folk Rock Music Releases by Decade Top Submitters of Folk Rock Music Most Sold Folk Rock Releases This Month Explore More Trending Folk Rock Music Tracy Chapman Tracy Chapman 0 0 0 Bon Iver, Bon Iver Bon Iver 0 0 0 Gold Dust - Live At The Royalty Sandy Denny 0 0 0 Brightside Bonus Tracks The Lumineers 0 0 0 Blue Highlights Joni Mitchell 0 0 0 A Frightened Rabbit EP Frightened Rabbit 0 0 0 Alternates & Rarities America (2) 0 0 0 Related Styles of Music Pop Rock Acoustic Indie Rock Folk Psychedelic Rock Country Rock Alternative Rock Prog Rock Blues Rock Soft Rock Classic Rock Experimental Punk Ballad Country",
    "acid+rock": "Acid Rock is a form of Rock Music which evolved from Psychedelic Rock and Psychedelic Music in general. Although Acid Rock is very similar to Psychedelic Rock, Acid Rock has more Blues, Folk, and Hard Rock aspects, than most Psychedelic Music. Just like Psychedelic Rock, Acid Rock also has its origins in the mid-1960s.It has also been noted that Acid Rock is considered to be more Heavy, Harsh, Hard, and Louder sound than its Psychedelic influences. Also, the lyrics usually contain drug references, and has long, usually improvised guitar solos, with distinct effects. Most Collected Acid Rock Music Explore More Popular Acid Rock Music Happy Trails Quicksilver Messenger Service 0 0 0 Maggot Brain Funkadelic 0 0 0 Vincebus Eruptum Blue Cheer 0 0 0 Aoxomoxoa Grateful Dead* 0 0 0 After Bathing At Baxter's Jefferson Airplane 0 0 0 Surrealistic Pillow Jefferson Airplane 0 0 0 Woodstock - Music From The Original Soundtrack And More Various 0 0 0 Acid Rock Artists The Doors 0 0 0 Jefferson Airplane 0 0 0 Jimi Hendrix 0 0 0 The Grateful Dead 0 0 0 The Jimi Hendrix Experience 0 0 0 Blue Cheer 0 0 0 Uncle Acid & The Deadbeats 0 0 0 Early Acid Rock Releases Explore More Early Acid Rock Music Jefferson Airplane Takes Off Jefferson Airplane 0 0 0 East-West The Butterfield Blues Band* 0 0 0 Scepter Studios Sessions The Velvet Underground 0 0 0 This World (Is Closing In On Me) Chris Carpenter (2) 0 0 0 Mary Jane (Get Off The Devil's Merry-Go-Round) The Renaissance* 0 0 0 Una Palida Sombra Procol Harum 0 0 0 Don't Avoid Me Jerry Palmer 0 0 0 Acid Rock Music Releases by Decade Top Submitters of Acid Rock Music Most Sold Acid Rock Releases This Month Explore More Trending Acid Rock Music Electric Ladyland The Jimi Hendrix Experience 0 0 0 Electric Ladyland The Jimi Hendrix Experience 0 0 0 Best of the Grateful Dead Live: Volume 1 The Grateful Dead 0 0 0 Volume One The Human Beast 0 0 0 Blood Lust Uncle Acid & The Deadbeats 0 0 0 Eve Speed, Glue & Shinki 0 0 0 House in the Tall Grass Kikagaku Moyo 0 0 0 Related Styles of Music Psychedelic Rock Hard Rock Blues Rock Prog Rock Garage Rock Folk Rock Stoner Rock Experimental Space Rock Classic Rock Alternative Rock Pop Rock Punk Indie Rock Doom Metal",
    "hard+rock": "Hard rock (or heavy rock) is a loosely defined subgenre of rock music which has its earliest roots in mid-1960s garage rock, blues rock and psychedelic rock. It is typified by a heavy use of aggressive vocals, distorted electric guitars, bass guitar, drums, and often accompanied with pianos and keyboards. Most Collected Hard Rock Music Explore More Popular Hard Rock Music Paranoid Black Sabbath 0 0 0 Led Zeppelin Led Zeppelin 0 0 0 Led Zeppelin II Led Zeppelin 0 0 0 Led Zeppelin III Led Zeppelin 0 0 0 Untitled Led Zeppelin 0 0 0 Back In Black AC/DC 0 0 0 Appetite For Destruction Guns N' Roses 0 0 0 Hard Rock Artists Led Zeppelin 0 0 0 Scorpions 0 0 0 Queen 0 0 0 AC/DC 0 0 0 Black Sabbath 0 0 0 Kiss 0 0 0 Deep Purple 0 0 0 Early Hard Rock Releases Explore More Early Hard Rock Music You Really Got Me The Kinks 0 0 0 Foxy Lady / Manic Depression The Jimi Hendrix Experience 0 0 0 I Mean It Him And The Others* 0 0 0 Les Shamrocks A Paris - Cadillac Les Shamrocks* 0 0 0 Helpful Man / Lies St. James' 0 0 0 Drums A Go-Go Hal Blaine, His Drums & Orchestra* 0 0 0 A Girl I Knew / The Ostrich Steppenwolf 0 0 0 Hard Rock Music Releases by Decade Top Submitters of Hard Rock Music Most Sold Hard Rock Releases This Month Explore More Trending Hard Rock Music Eve Speed, Glue & Shinki 0 0 0 Danger Danger Danger Danger 0 0 0 Waking The Dead L.A. Guns 0 0 0 High 'N' Dry Def Leppard 0 0 0 We Die Young Alice In Chains 0 0 0 Live 1979 Bad Company (3) 0 0 0 Going To Hell The Pretty Reckless 0 0 0 Related Styles of Music Heavy Metal Classic Rock Blues Rock Pop Rock Alternative Rock Prog Rock Glam Psychedelic Rock Punk AOR Rock & Roll Arena Rock Oi Stoner Rock Garage Rock",
    "classical": "Classical music is art music produced or rooted in the traditions of Western music (both liturgical and secular). It encompasses a broad span of time from roughly the 11th century to the present day. The central norms of this tradition became codified between 1550 and 1900, which is known as the common practice period. The major time divisions of classical music are as follows: the early music period, which includes Medieval (500–1400) and the Renaissance (1400–1600); the Common practice period, which includes the Baroque (1600–1750), Classical (1750–1830) and Romantic (1804–1910); the 20th century (1901–2000) which includes the modern period (1890-1930) that overlaps from the late 19th-century, the high modern (mid 20th-century), and contemporary (1975–2000) period, the last of which overlaps into the 21st-century. Most Collected Classical Music Explore More Popular Classical Music Concerto For Group And Orchestra Deep Purple / The Royal Philharmonic Orchestra 0 0 0 Works (Volume 1) Emerson Lake & Palmer* 0 0 0 Star Wars John Williams (4), The London Symphony Orchestra 0 0 0 Star Wars / The Empire Strikes Back John Williams (4), The London Symphony Orchestra 0 0 0 The Six Wives Of Henry VIII Rick Wakeman 0 0 0 Stanley Kubrick's A Clockwork Orange (Music From The Soundtrack) Various 0 0 0 2001: A Space Odyssey (Music From The Motion Picture Sound Track) Various 0 0 0 Classical Artists Johann Sebastian Bach 0 0 0 Ludwig van Beethoven 0 0 0 Wolfgang Amadeus Mozart 0 0 0 Joseph Haydn 0 0 0 Franz Schubert 0 0 0 Johannes Brahms 0 0 0 Pyotr Ilyich Tchaikovsky 0 0 0 Early Classical Releases Explore More Early Classical Music Rigoletto - Questa O Quella Enrico Caruso 0 0 0 Tosca: Vissi D'Arte S. Kruszelnicka* 0 0 0 Manon Enrico Caruso 0 0 0 \"Арiя Сусанина\" Изъ Оп. \"Жизнь За Царя\" Ф. И. Шаляпинъ* 0 0 0 Pagliacci - Vesti La Giubba Enrico Caruso 0 0 0 Luna Fedel Enrico Caruso 0 0 0 Anvil Chorus From \"Il Trovatore\" Columbia Band 0 0 0 Classical Music Releases by Decade Top Submitters of Classical Music Most Sold Classical Releases This Month Explore More Trending Classical Music Shepherd Moons Enya 0 0 0 千と千尋の神隠し サウンドトラック 久石譲* 0 0 0 Eternal Sunshine Of The Spotless Mind (Original Soundtrack) Jon Brion, Various 0 0 0 The Pavilion Of Dreams Harold Budd 0 0 0 Nujabes Pray Reflections Haruka Nakamura 0 0 0 Consumed In Key Plastikman & Chilly Gonzales* 0 0 0 Pure Maria Callas 0 0 0 Related Styles of Music Romantic Baroque Modern Opera Contemporary Renaissance Neo-Classical Soundtrack Religious Choral Experimental Vocal Easy Listening Modern Classical",
    "ballad": "A popular narrative song passed down orally. In the English tradition, it usually follows a form of rhymed (abcb) quatrains alternating four-stress and three-stress lines. Folk (or traditional) ballads are anonymous and recount tragic, comic, or heroic stories with emphasis on a central dramatic event; examples include “Barbara Allen” and “John Henry.” Most Collected Ballad Music Explore More Popular Ballad Music Blood On The Tracks Bob Dylan 0 0 0 Reckless Bryan Adams 0 0 0 52nd Street Billy Joel 0 0 0 True Blue Madonna 0 0 0 Welcome To The Pleasuredome Frankie Goes To Hollywood 0 0 0 Off The Wall Michael Jackson 0 0 0 Folklore Taylor Swift 0 0 0 Ballad Artists Céline Dion 0 0 0 Elvis Presley 0 0 0 Frank Sinatra 0 0 0 Roberto Carlos 0 0 0 Milva 0 0 0 Camilo Sesto 0 0 0 Claudio Villa 0 0 0 Early Ballad Releases Explore More Early Ballad Music All Through The Night Evan Williams (3) 0 0 0 Oh Dry Those Tears Evan Williams (3) 0 0 0 Where Is My Wandering Boy To-Night? Henry Burr 0 0 0 I Can See Red Roses Blooming / If Those Lips Could Only Speak Percy Hamilton 0 0 0 An Evening Song / Because Lloyd Chandos / Andrew Black (3) 0 0 0 One Sweetly Solemn Thought / Lead Kindly Light Henry Burr / Unknown Artist 0 0 0 In The Shade Of The Old Apple Tree Harry Macdonough And Haydn Quartet 0 0 0 Ballad Music Releases by Decade Top Submitters of Ballad Music Most Sold Ballad Releases This Month Explore More Trending Ballad Music ...But Seriously Phil Collins 0 0 0 For You Tatsuro Yamashita 0 0 0 NFR! Lana Del Rey 0 0 0 Star-Crossed Kacey Musgraves 0 0 0 #1's Mariah* 0 0 0 #1's Mariah Carey 0 0 0 Lost In Your Eyes (The Duet) Debbie Gibson & Joey McIntyre 0 0 0 Related Styles of Music Vocal Pop Rock Chanson Europop Synth-pop Schlager Soft Rock Soul Disco Folk Rock & Roll Easy Listening Acoustic Country Rhythm & Blues",
    "free+improvisation": "Free improvisation is improvised music without any rules beyond the logic or inclination of the musician(s) involved. The term can refer to both a technique (employed by any musician in any genre) and as a recognizable genre in its own right.HistoryFree improvisation, as a genre of music, developed in the U.S. and Europe in the mid to late 1960s. The musical advancements made through improvisation through Free Jazz served as inspiration to European musicians, who then created \"Free Improvisation\" as a differentiation. Exponents of free improvised music include saxophonists Evan Parker, Anthony Braxton, Peter Brötzmann and John Zorn, drummer Christian Lillinger, trombonist George Lewis, guitarists Derek Bailey, Henry Kaiser and Fred Frith and the improvising groups Spontaneous Music Ensemble, The Art Ensemble of Chicago and AMM.CharacteristicsIn an atonal context, free improvisation refers to where the focus shifts from harmony to other dimensions of music: timbre, melodic intervals, rhythm and the spontaneous interaction between musicians. Although performers may choose to play in a certain style or key, or at a certain tempo, conventional songs are highly uncommon in free improvisation; more emphasis is generally placed on mood, texture or more simply, on performative gesture than on preset forms of melody, harmony or rhythm. These elements are improvised at will, as the music progresses.At the same time, Free Improvisation is a problematic term. It is neither free nor improvised as in their strict definitions. Musicians who play free improvisation develop highly individualized musical vocabulary which are then played without the restriction of a score. In this sense, the freedom implied by the term Free Improvisation is more of an aesthetic of playing towards notions of freedom than freedom in the pure sense.As it has influenced and been influenced by other areas of exploration, aspects of modern classical music (extended techniques), noise rock (aggressive confrontation and dissonance), IDM (computer manipulation and digital synthesis), minimalism and electroacoustic music can now be heard in free improvisation. Most Collected Free Improvisation Music Explore More Popular Free Improvisation Music The Köln Concert Keith Jarrett 0 0 0 Solo Concerts: Bremen / Lausanne Keith Jarrett 0 0 0 Kulu Sé Mama John Coltrane 0 0 0 Thembi Pharoah Sanders 0 0 0 Meditations John Coltrane 0 0 0 Inventions And Dimensions Herbie Hancock 0 0 0 Your Queen Is A Reptile Sons Of Kemet 0 0 0 Free Improvisation Artists Derek Bailey 0 0 0 Evan Parker 0 0 0 Mats Gustafsson 0 0 0 Cecil Taylor 0 0 0 John Butcher 0 0 0 Anthony Braxton 0 0 0 The Grateful Dead 0 0 0 Early Free Improvisation Releases Explore More Early Free Improvisation Music The Piano Music Of Henry Cowell Henry Cowell 0 0 0 Inside Sauter-Finegan The Sauter-Finegan Orchestra* 0 0 0 Spotlight On Percussion Kenny Clarke, Arnold Goldberg, Al Collins* 0 0 0 L'Ame Tzigane Sándor Lakatos 0 0 0 Dean's Lament James Dean, Bob Romeo, Duke Mitchell 0 0 0 Voodoo Drums In Hi-fi Voodoo Drums 0 0 0 The Drum Suite Volume 3 Manny Albam-Ernie Wilkins And Their Orchestra* 0 0 0 Free Improvisation Music Releases by Decade Top Submitters of Free Improvisation Music Most Sold Free Improvisation Releases This Month Explore More Trending Free Improvisation Music The Köln Concert Keith Jarrett 0 0 0 So Many Roads (1965-1995) Grateful Dead* 0 0 0 Organic Music Society Don Cherry 0 0 0 The Köln Concert Keith Jarrett 0 0 0 Your Queen Is A Reptile Sons Of Kemet 0 0 0 John Tchicai With Strings John Tchicai 0 0 0 Warning: Uninc. (Live And Experimental Recordings 1971-1972) The Residents 0 0 0 Related Styles of Music Experimental Free Jazz Contemporary Jazz Avant-garde Jazz Noise Avantgarde Abstract Psychedelic Rock Ambient Contemporary Fusion Drone Folk Jazz-Rock Art Rock",
    "pop+rock": "Pop Rock is a style of Rock with a strong commercial slant (and associated radio exposure). It emerged in the late 1950s, to an extent taking over from the earlier Rock & Roll style. There is some overlap with the 1960s Beat style. This term can be used to describe rock music that follows the traditional \"rock\" format: drums, guitar, bass & vocals, with catchy hooks / riffs, & vocals. In its earlier appearances, it was in the mainstream/vanguard of rock - by the late 1960s, the connotation of the term had become more lightweight. Most Collected Pop Rock Music Explore More Popular Pop Rock Music Purple Rain Prince And The Revolution 0 0 0 Sgt. Pepper's Lonely Hearts Club Band The Beatles 0 0 0 Abbey Road The Beatles 0 0 0 Rumours Fleetwood Mac 0 0 0 Revolver The Beatles 0 0 0 The Beatles The Beatles 0 0 0 Hotel California Eagles 0 0 0 Pop Rock Artists U2 0 0 0 David Bowie 0 0 0 Rod Stewart 0 0 0 Elton John 0 0 0 The Beach Boys 0 0 0 Queen 0 0 0 The Beatles 0 0 0 Early Pop Rock Releases Explore More Early Pop Rock Music Rockin' The Ark / Spooks Played A Tune On A Tombstone Johnny Arcesi* 0 0 0 The Hit Makers! Part 1 Les Paul And Mary Ford* 0 0 0 Near You / My Happiness The Mulcays And Their Electric Harmonicas* 0 0 0 Near You / My Happiness The Mulcays And Their Electric Harmonicas* 0 0 0 The Hit Makers! Part II Les Paul & Mary Ford 0 0 0 Lemon Squeezer Jimmy Wilson (10) 0 0 0 Chicka Boom / Hannah Lee Guy Mitchell 0 0 0 Pop Rock Music Releases by Decade Top Submitters of Pop Rock Music Most Sold Pop Rock Releases This Month Explore More Trending Pop Rock Music Northern Star Melanie C 0 0 0 A Celebration U2 0 0 0 More Hot Rocks (Big Hits & Fazed Cookies) Rolling Stones* 0 0 0 5X5 Live Simple Minds 0 0 0 Little Voice Sara Bareilles 0 0 0 Toy E.P. (\"You've Got It Made With All The Toys\") David Bowie 0 0 0 Toy E.P. (\"You've Got It Made With All The Toys\") David Bowie 0 0 0 Related Styles of Music Synth-pop Soft Rock Ballad Alternative Rock Vocal Rock & Roll Indie Rock Folk Rock Classic Rock New Wave Psychedelic Rock Disco Soul Chanson Europop",
    "soul": "Soul music is a popular music genre that originated in the United States in the 1950s and early 1960s. It combined elements of African-American gospel music, rhythm and blues, and often jazz. Soul music became popular for dancing and listening in the United States—where record labels such as Motown, Atlantic and Stax labels were influential during the period of the civil rights movement. Soul also became popular around the world, directly influencing rock music and the music of Africa.Like Southern soul, Deep Soul is gritty, funky soul music that borrows equally from the fervor of Southern gospel and the hard-driving energy of R&B. Most Collected Soul Music Explore More Popular Soul Music Bad Michael Jackson 0 0 0 Thriller Michael Jackson 0 0 0 Diamond Life Sade 0 0 0 Back To Black Amy Winehouse 0 0 0 What's Going On Marvin Gaye 0 0 0 Songs In The Key Of Life Stevie Wonder 0 0 0 Off The Wall Michael Jackson 0 0 0 Soul Artists James Brown 0 0 0 The Supremes 0 0 0 Stevie Wonder 0 0 0 Marvin Gaye 0 0 0 The Temptations 0 0 0 Aretha Franklin 0 0 0 Diana Ross 0 0 0 Early Soul Releases Explore More Early Soul Music You're Mine / Milk And Gin The Crickets (6) 0 0 0 Ee-Til-Ya-Dee / La Cumbanchero The Tilters 0 0 0 Salty Dog / Sweetheart, Darling Marvin Phillipps* 0 0 0 Make Me A Present Of You / Don't Lead Me On Ernie Andrews With Benny Carter Orchestra* 0 0 0 Baby Come Back To Me / Lonely Mood The Five Echoes* With Fats Cole's Band 0 0 0 Not Alone / Man Called Jesus The Pearly Gates Spiritual Singers 0 0 0 Till I Waltz Again With You / Can't Wait For Tomorrow Five Bills 0 0 0 Soul Music Releases by Decade Top Submitters of Soul Music Most Sold Soul Releases This Month Explore More Trending Soul Music Man On The Moon: The End Of Day Kid Cudi 0 0 0 Hot Pink Doja Cat 0 0 0 Travelling Without Moving Jamiroquai 0 0 0 The Lost Queen Of New Orleans Soul Betty Harris 0 0 0 Live In Loveland! Delvon Lamarr Organ Trio 0 0 0 The Sea Corinne Bailey Rae 0 0 0 LP1 Joss Stone 0 0 0 Related Styles of Music Funk Disco Rhythm & Blues Pop Rock Ballad Vocal Gospel Synth-pop Rock & Roll RnB/Swing Contemporary R&B Jazz-Funk Boogie Downtempo House",
    "soft+rock": "Simply put, it features the instruments and elements of Pop Rock, but it's much softer/lighter in nature. May also be referred to as \"light rock\" or \"easy rock\". The style originated in the early 1970s, partly as a reaction to the hard rock which had become popular towards the end of the 1960s. Songs were generally commercial and innocuous, with less rock & roll than had been evident in the Pop Rock of the 1960s Beat era.Soft Rock ontstond in de vroege jaren '70, gedeeltelijk als reactie op de extreme geluiden van eind jaren '60. Softrock was commercieel en onschadelijk, nam het geluid van singer-songwriter en pop-rock maar maakte alle randen glad. Most Collected Soft Rock Music Explore More Popular Soft Rock Music Let It Be The Beatles 0 0 0 Bridge Over Troubled Water Simon and Garfunkel* 0 0 0 Invisible Touch Genesis 0 0 0 Rumours Fleetwood Mac 0 0 0 The Stranger Billy Joel 0 0 0 Glass Houses Billy Joel 0 0 0 Guardians Of The Galaxy: Awesome Mix Vol. 1 (Original Motion Picture Soundtrack) Various 0 0 0 Soft Rock Artists Elton John 0 0 0 Chicago (2) 0 0 0 Carpenters 0 0 0 Smokie 0 0 0 America (2) 0 0 0 James Taylor (2) 0 0 0 Neil Diamond 0 0 0 Early Soft Rock Releases Explore More Early Soft Rock Music Twenty-Six Miles / Tequila Bill & Ronnie With Jimmy Carroll & Orchestra* 0 0 0 Old Spanish Town The Bell Notes 0 0 0 Skinnie Minnie (Fish Tail) / I Had Someone Else Before I Had You (And I'll Have Someone After You're Gone) Teresa Brewer 0 0 0 When I Stop Loving You / You Are My Destiny Paul Anka 0 0 0 Selección N.º 3 Renato Carosone Y Su Cuarteto* 0 0 0 \"Pat\" Part 2 Pat Boone 0 0 0 Ehi Tu Dora Musumeci 0 0 0 Soft Rock Music Releases by Decade Top Submitters of Soft Rock Music Most Sold Soft Rock Releases This Month Explore More Trending Soft Rock Music Faith George Michael 0 0 0 ...But Seriously Phil Collins 0 0 0 NFR! Lana Del Rey 0 0 0 Northern Star Melanie C 0 0 0 Little Voice Sara Bareilles 0 0 0 Alternates & Rarities America (2) 0 0 0 Little Voice Sara Bareilles 0 0 0 Related Styles of Music Pop Rock Ballad Vocal Folk Rock Synth-pop Classic Rock Soul Acoustic Disco Rock & Roll Country Rock Alternative Rock Hard Rock Blues Rock AOR",
    "art+rock": "rock music that incorporates elements of high art, particularly from classical realms Most Collected Art Rock Music Explore More Popular Art Rock Music The Wall Pink Floyd 0 0 0 Pet Sounds The Beach Boys 0 0 0 In Rainbows Radiohead 0 0 0 Breakfast In America Supertramp 0 0 0 The Velvet Underground & Nico The Velvet Underground & Nico (3) 0 0 0 So Peter Gabriel 0 0 0 Tommy The Who 0 0 0 Art Rock Artists David Bowie 0 0 0 Peter Gabriel 0 0 0 Lou Reed 0 0 0 The Velvet Underground 0 0 0 King Crimson 0 0 0 Kate Bush 0 0 0 Frank Zappa 0 0 0 Early Art Rock Releases Explore More Early Art Rock Music Pet Sounds The Beach Boys 0 0 0 Scepter Studios Sessions The Velvet Underground 0 0 0 Walk Away Renée / Pretty Ballerina The Left Banke 0 0 0 Number Nine / Do What You Wanta Van Dyke Parks 0 0 0 Live Your Life The Kinetic 0 0 0 Come To The Sunshine / Farther Along Van Dyke Parks 0 0 0 All Tomorrow's Parties The Velvet Underground And Nico (3) 0 0 0 Art Rock Music Releases by Decade Top Submitters of Art Rock Music Most Sold Art Rock Releases This Month Explore More Trending Art Rock Music Remain In Light Talking Heads 0 0 0 Low David Bowie 0 0 0 Tubular Bells II Mike Oldfield 0 0 0 Brilliant Adventure EP David Bowie 0 0 0 Brilliant Adventure EP David Bowie 0 0 0 Camera Obscura Nico (3) + The Faction* 0 0 0 The Century Of Self ...And You Will Know Us By The Trail Of Dead 0 0 0 Related Styles of Music Experimental Prog Rock Alternative Rock Indie Rock Avantgarde Pop Rock Psychedelic Rock New Wave Punk Folk Rock Post-Punk Noise Synth-pop Classic Rock Post Rock",
    "chanson": "A chanson is in general any lyric-driven French song, usually polyphonic and secular. A singer specializing in chansons is known as a \"chanteur\" (male) or \"chanteuse\" (female); a collection of chansons, especially from the late Middle Ages and Renaissance, is also known as a chansonnier. Most Collected Chanson Music Explore More Popular Chanson Music Aux Armes Et Cætera Gainsbourg* 0 0 0 Je T'aime... Moi Non Plus Jane Birkin Avec Serge Gainsbourg 0 0 0 Kill Bill Vol. 1 (Original Soundtrack) Various 0 0 0 Portfolio Grace Jones 0 0 0 Famous Blue Raincoat (The Songs Of Leonard Cohen) Jennifer Warnes 0 0 0 Brel Brel* 0 0 0 Cabaret - Original Soundtrack Recording Various 0 0 0 Chanson Artists Dalida 0 0 0 Edith Piaf 0 0 0 Milva 0 0 0 Adamo 0 0 0 Mina (3) 0 0 0 Charles Aznavour 0 0 0 Françoise Hardy 0 0 0 Early Chanson Releases Explore More Early Chanson Music La Dernière Carotte Polin 0 0 0 Le Piston Embarrassé Charlus 0 0 0 Who? / That Certain Feeling Melle. Joséphine Baker* 0 0 0 Eu Știu Că Ai Să Mă Înșeli Chiar Mâine / Săte Iubesc Fănică Georgescu 0 0 0 Les Vierges / Le Jeune Homme Triste Mme. Yvette Guilbert* 0 0 0 Лебединая Пѣснь / Я Ждалъ Тебя Варя Панина 0 0 0 Rugby-Marche / Ce N'Est Pas La Même Chose M. Chevalier* 0 0 0 Chanson Music Releases by Decade Top Submitters of Chanson Music Most Sold Chanson Releases This Month Explore More Trending Chanson Music Le Best Of Arno Arno (2) 0 0 0 French Bazaar Arno (2) 0 0 0 La Fabuleuse Histoire De Mister Swing Michel Jonasz 0 0 0 Racine Carrée Stromae 0 0 0 Music To Make Love To Your Old Lady By Nathaniel Merriweather Presents Lovage Avec Michael Patton* & Jennifer Charles 0 0 0 Multitude Stromae 0 0 0 Music To Make Love To Your Old Lady By Nathaniel Merriweather Presents Lovage Avec Michael Patton* & Jennifer Charles 0 0 0 Related Styles of Music Vocal Ballad Pop Rock Schlager Folk Synth-pop Europop Disco Easy Listening Soundtrack Rock & Roll Folk Rock Yé-Yé Beat Comedy",
    "disco": "One of the main genres of dance music of the XX century, which arose in the early 1970s. Most Collected Disco Music Explore More Popular Disco Music Parallel Lines Blondie 0 0 0 Thriller Michael Jackson 0 0 0 Like A Virgin Madonna 0 0 0 Saturday Night Fever (The Original Movie Sound Track) Various 0 0 0 Songs In The Key Of Life Stevie Wonder 0 0 0 Off The Wall Michael Jackson 0 0 0 Random Access Memories Daft Punk 0 0 0 Disco Artists Donna Summer 0 0 0 Gloria Gaynor 0 0 0 Michael Jackson 0 0 0 Diana Ross 0 0 0 Kool & The Gang 0 0 0 ABBA 0 0 0 Boney M. 0 0 0 Early Disco Releases Explore More Early Disco Music Sweet Inspiration Johnny Johnson And The Bandwagon 0 0 0 (Blame It) On The Pony Express Johnny Johnson & His Bandwagon* 0 0 0 14 Noi Șlagăre Mondiale Various 0 0 0 Soleil, Soleil / Change Petit Ange Bernard Constant 0 0 0 Lo Mejor Del Año Various 0 0 0 Fulminato Soluzione Due 0 0 0 I've Got You On My Mind Blue Horizon (12) 0 0 0 Disco Music Releases by Decade Top Submitters of Disco Music Most Sold Disco Releases This Month Explore More Trending Disco Music Random Access Memories Daft Punk 0 0 0 Hot Pink Doja Cat 0 0 0 Random Access Memories Daft Punk 0 0 0 Discovery Daft Punk 0 0 0 Travelling Without Moving Jamiroquai 0 0 0 The Complete Thom Bell Sessions Elton John 0 0 0 Ne:Ep Erasure 0 0 0 Related Styles of Music Funk Soul House Synth-pop Pop Rock Electro Ballad Boogie Europop Deep House Downtempo Italo-Disco Hi NRG Vocal Jazz-Funk",
    "jazz-rock": "Jazz-rock may refer to the loudest, wildest, most electrified fusion bands from the jazz camp, but most often it describes performers coming from the rock side of the equation. Jazz-rock first emerged during the late '60s as an attempt to fuse the visceral power of rock with the musical complexity and improvisational fireworks of jazz. Since rock often emphasized directness and simplicity over virtuosity, jazz-rock generally grew out of the most artistically ambitious rock subgenres of the late '60s and early '70s: psychedelia, progressive rock, and the singer/songwriter movement. The latter drew from the mellower, more cerebral side of jazz, often employing vocal as well as instrumental improvisation; this school's major figures included Joni Mitchell, Van Morrison, and Tim Buckley. Most jazz-rock, however, was played by higher-energy rock ensembles. Some of them were more jam-oriented, borrowing jazz harmonies and instruments for their extended, rock-flavored improvisations (Traffic, Santana). Others recorded jazz-flavored R&B or pop songs that used the melodic, harmonic, and rhythmic sensibilities of jazz, but weren't as interested in improvisation or instrumental virtuosity (Blood, Sweat & Tears, Chicago, Steely Dan). Still others used jazz's complexity to expand rock's musical horizons, not just in terms of instrumental technique but in crafting quirky, challenging, unpredictable compositions (Frank Zappa, the Soft Machine). The major exception was Miles Davis, the first jazz musician since the early R&B era to covet the earthy power of rock & roll and the impact it had on young audiences. Starting with 1970's Bitches Brew, Davis' early-'70s fusion workouts -- greatly inspired by Jimi Hendrix and Sly & the Family Stone -- quickly became some of the funkiest, edgiest, most aggressive jazz-rock ever recorded. While figures like Zappa and $Steely Dan continued to record jazz-rock through the '70s, the movement had essentially dissipated by the '80s, as a mellower form of fusion captured its audience.Not to be confused with Jazz-Rock Fusion: https://www.discogs.com/style/fusion Most Collected Jazz-Rock Music Explore More Popular Jazz-Rock Music Aja Steely Dan 0 0 0 The Royal Scam Steely Dan 0 0 0 Pretzel Logic Steely Dan 0 0 0 Gaucho Steely Dan 0 0 0 Hot Rats Frank Zappa 0 0 0 Chicago Transit Authority Chicago Transit Authority* 0 0 0 ★ (Blackstar) David Bowie 0 0 0 Jazz-Rock Artists Miles Davis 0 0 0 Santana 0 0 0 Frank Zappa 0 0 0 Chicago (2) 0 0 0 John McLaughlin 0 0 0 Soft Machine 0 0 0 Blood, Sweat And Tears 0 0 0 Early Jazz-Rock Releases Explore More Early Jazz-Rock Music The Beat Red Prysock And His Orchestra 0 0 0 In The Mood Ernie Field's Orchestra* 0 0 0 Easy Dancing Noel Chibous And His Orchestra* 0 0 0 Mack The Knife Volume 2 Bobby Darin 0 0 0 Boogie Woogie / To Each His Own Danny Welton 0 0 0 Rock, Rock, Rock Georgia Gibbs 0 0 0 Ronnie Cord Ronnie Cord 0 0 0 Jazz-Rock Music Releases by Decade Top Submitters of Jazz-Rock Music Most Sold Jazz-Rock Releases This Month Explore More Trending Jazz-Rock Music Gaucho Steely Dan 0 0 0 Moonglow Tatsu Yamashita* 0 0 0 Moonflower Santana 0 0 0 Gaucho Steely Dan 0 0 0 Roots Ian Carr's Nucleus* 0 0 0 African Rock Akira Ishikawa & His Count Buffalos* 0 0 0 Japanese Jazz Spectacle Vol. I (Deep, Heavy & Beautiful Jazz From Japan 1968-1984) Various 0 0 0 Related Styles of Music Fusion Prog Rock Jazz-Funk Psychedelic Rock Pop Rock Blues Rock Contemporary Jazz Experimental Avantgarde Funk Folk Rock Soul-Jazz Art Rock Classic Rock Free Jazz",
    "vocal": "Although nearly all pop music involves sung vocals, in Vocal pop music, there is an exceptional emphasis on a virtuosic, solo vocal performance which carries almost the entire melody. The backing music is often a relatively simple accompaniment by chords in a lower register, although it can include lush orchestral or big-band arrangements as well. Rhythm sections tend to be very subdued, if present at all.Record shops and collectors typically use the term Vocal in reference to mainstream, \"white\", \"adult\" English-language pop music of the 1950s and 1960s: mainly ballads and standards which continue the tradition of vocal jazz, without the improvisational elements. The style's peak coincided with the early rock & roll era, after which most Vocal pop became regarded as \"easy listening\" music, but it continues to enjoy waves of popularity throughout the world to the present day.On Discogs, perhaps due to unfamiliarity with the style, the Vocal tag is not used so strictly. It is found on all kinds of pop releases from all eras, whenever a vocal solo dominates the performance. However, it should not be used on just any pop music with vocals. It is inappropriate for especially highly rhythmic pop or music which is better tagged with a regional style such as Chanson (French-language vocal pop) or a style under the Folk, World & Country genre. Most Collected Vocal Music Explore More Popular Vocal Music Pet Sounds The Beach Boys 0 0 0 The Album ABBA 0 0 0 Bookends Simon & Garfunkel 0 0 0 The Dream Of The Blue Turtles Sting 0 0 0 Whitney Houston Whitney Houston 0 0 0 The Stranger Billy Joel 0 0 0 Tapestry Carole King 0 0 0 Vocal Artists Dean Martin 0 0 0 Perry Como 0 0 0 Ella Fitzgerald 0 0 0 Frank Sinatra 0 0 0 Nat King Cole 0 0 0 Bing Crosby 0 0 0 Connie Francis 0 0 0 Early Vocal Releases Explore More Early Vocal Music The Whistling Coon Burt Shepard 0 0 0 Whistling Mike Jno Terrell* 0 0 0 Lead Kindly Light Haydn Quartet 0 0 0 Put Me Off At Buffalo Mr. John Terrell* 0 0 0 In The Shadow Of The Pines Macdonough* & Madeira* 0 0 0 The Holy City J. W. Myers 0 0 0 Old Black Joe Haydn Quartet 0 0 0 Vocal Music Releases by Decade Top Submitters of Vocal Music Most Sold Vocal Releases This Month Explore More Trending Vocal Music Harry Styles Harry Styles 0 0 0 Harry Styles Harry Styles 0 0 0 How I'm Feeling Now Charli XCX 0 0 0 Why Don't You Go Home / Cocktail de Medianoche Diane Ward (3), The Kevin Fingier Collective 0 0 0 The Definitive 12\" Singles 1983 - 1987 Sheena Easton 0 0 0 Doves + Ravens Dermot Kennedy 0 0 0 See All Her Faces Dusty Springfield 0 0 0 Related Styles of Music Ballad Chanson Pop Rock Schlager Easy Listening Swing Soul Folk Big Band Europop Rock & Roll Country Rhythm & Blues Soundtrack Synth-pop",
    "rock+&+roll": "Rock music or rock and roll in full name is a genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the late 1950s, 1960s and later, particularly in the United Kingdom and the United States. Its roots are in 1950s' American rock and roll when and where it first started, itself heavily influenced by rhythm and blues and country music. Rock music also drew strongly on a number of other genres such as blues and folk, and incorporated influences from jazz, classical and other musical sources. Most Collected Rock & Roll Music Explore More Popular Rock & Roll Music Greatest Hits Queen 0 0 0 1962-1966 The Beatles 0 0 0 Sgt. Pepper's Lonely Hearts Club Band The Beatles 0 0 0 Please Please Me The Beatles 0 0 0 Rubber Soul The Beatles 0 0 0 War U2 0 0 0 Some Girls The Rolling Stones 0 0 0 Rock & Roll Artists The Rolling Stones 0 0 0 Elvis Presley 0 0 0 The Beatles 0 0 0 Chuck Berry 0 0 0 Jerry Lee Lewis 0 0 0 Johnny Hallyday 0 0 0 Bill Haley And His Comets 0 0 0 Early Rock & Roll Releases Explore More Early Rock & Roll Music Rocket \"88\" / Tearstains On My Heart Bill Haley And The Saddlemen 0 0 0 Boogie Woogie Lou / Rain-Rain-Rain Joe Liggins And His \"Honeydrippers\"* 0 0 0 I'm Going To Have Myself A Ball / Butterfly Tiny Bradshaw 0 0 0 Comp Gordon MacRae, Dean Martin, Artie Malvin, Billy Daniels, Loren Becker, The Brigadiers Quartet 0 0 0 I Need You So / Leave Her Alone Ivory Joe Hunter 0 0 0 Hangover Boogie / Dose Of Your Own Medicine Bob Newman 0 0 0 Bayou Baby Blues Maggie Hathaway With The Robins And 2 Sharps And A Natural 0 0 0 Rock & Roll Music Releases by Decade Top Submitters of Rock & Roll Music Most Sold Rock & Roll Releases This Month Explore More Trending Rock & Roll Music Wildflowers & All The Rest Tom Petty 0 0 0 Unlimited Love Red Hot Chili Peppers 0 0 0 Unlimited Love Red Hot Chili Peppers 0 0 0 More Hot Rocks (Big Hits & Fazed Cookies) Rolling Stones* 0 0 0 Modern Lovers 88 Jonathan Richman And The Modern Lovers* 0 0 0 The Löst Tapes Vol. 2 (Live In Norwich 1998) Motörhead 0 0 0 Memphis In June Reigning Sound 0 0 0 Related Styles of Music Pop Rock Rockabilly Rhythm & Blues Punk Garage Rock Blues Rock Vocal Classic Rock Doo Wop Ballad Beat Surf Hard Rock Soul Country Rock",
    "folk,+world,+&+country": "This genre, as well as covering country, also encompasses many different styles of music from around the world, most of which are region-specific, such as Asian, African, and various location-specific forms of classical. Discogs has now provided many highly specific style tags for these, which will help to bring much more accuracy to your entries, as world music on its own is very vague as a description. Most Collected Folk, World, & Country Music Explore More Popular Folk, World, & Country Music The Freewheelin' Bob Dylan Bob Dylan 0 0 0 Moondance Van Morrison 0 0 0 Crosby, Stills & Nash Crosby, Stills & Nash 0 0 0 At Folsom Prison Johnny Cash 0 0 0 Johnny Cash At San Quentin Johnny Cash 0 0 0 Graceland Paul Simon 0 0 0 Folklore Taylor Swift 0 0 0 Folk, World, & Country Artists Bob Dylan 0 0 0 Johnny Cash 0 0 0 Mikis Theodorakis 0 0 0 Willie Nelson 0 0 0 Jim Reeves 0 0 0 George Jones (2) 0 0 0 Laxmikant-Pyarelal 0 0 0 Early Folk, World, & Country Releases Explore More Early Folk, World, & Country Music Turkey In The Straw Billy Golden 0 0 0 Nearer My God To Thee Haydn Quartet 0 0 0 Hi Le Hi Lo George P. Watson 0 0 0 In The Sweet Bye And Bye Haydn Quartet 0 0 0 The Birds And The Brook Columbia Orchestra 0 0 0 Lauderbach George P. Watson 0 0 0 Asleep In The Deep Mr. J. W. Myers* 0 0 0 Folk, World, & Country Music Releases by Decade Top Submitters of Folk, World, & Country Music Most Sold Folk, World, & Country Releases This Month Explore More Trending Folk, World, & Country Music Motomami Rosalía (3) 0 0 0 The Lakes Taylor Swift 0 0 0 Kauai Gambino* With Jaden \"The Boy\" Smith* 0 0 0 Wembley Empire Pool, London, England 4/8/72 The Grateful Dead 0 0 0 Shuckin' Sugar Karen Dalton 0 0 0 Blue Highlights Joni Mitchell 0 0 0 Live At The Texas Opry House 1974 Willie Nelson 0 0 0 Related Styles of Music Folk Country Folk Rock Vocal African Laïkó Gospel Ballad Country Rock Bluegrass Chanson Soundtrack Pop Rock Celtic Acoustic"
}