{
    "big+band": "Should be used to describe recordings by a large orchestra which feature brass sections with multiple trumpets and trombones and a large reed section. A feature is that whole sections (the brass, the reeds) often play some parts of the tune in unison while leaving room for soloists at certain times. This style of orchestra began to be developed in the early 1920s by prominent dance band leaders such as Paul Whiteman and Fletcher Henderson, but the majority of 1920s dance bands were smaller groups and did not play in the \"big band\" style. It was not until 1929/30 or so that the majority of dance bands adopted this configuration (examples are the Casa Loma Orchestra, Mills Blue Rhthm Band, Duke Ellington's Orchestra) and big bands became the norm from the mid-1930s onwards. This style should be use sparingly before about 1930 as while there were other orchestras recorded similar to those led by Whiteman and Henderson (already mentioned) the majority of 1920s dance bands are not \"big bands\". From the 1930s onwards this style can be applied to recordings by any large orchestra. There were both jazz big bands (such as Benny Goodman, Tommy Dorsey, Glenn Miller, Jimmy Lunceford, Count Basie, etc.) and \"sweet\" big bands (such as Freddy Martin, Sammy Kaye, and Guy Lombardo's Royal Canadians). This style is often linked to the \"swing\" style (as in \"big bands of the swing era\") but it is better to avoid use the big band and swing tags together as they do not mean exactly the same thing. In reality not all swing groups were big bands, and some big bands featured small groups made up of star musicians from the larger orchestra (Benny Goodman Trio/Quartet/Sextet, Tommy Dorsey's Clambake Seven, Artie Shaw's Gramercy Five, etc.) and it is these smaller groups which played in the \"swing\" style. A useful distinction is that big band recordings feature large amounts of section work (notably the brass and/or the reeds) while smaller \"swing\" groups were more about featured soloists backed by a rhythm section. The big band style was most  prominent during the 1930s and 1940s but was still very popular up into the 1950s and many big band style recordings continued to be made during the 1960s and later.",
    "pop+rock": "Pop Rock is a style of Rock with a strong commercial slant (and associated radio exposure). It emerged in the late 1950s, to an extent taking over from the earlier Rock & Roll style. There is some overlap with the 1960s Beat style. This term can be used to describe rock music that follows the traditional \"rock\" format: drums, guitar, bass & vocals, with catchy hooks / riffs, & vocals. In its earlier appearances, it was in the mainstream/vanguard of rock - by the late 1960s, the connotation of the term had become more lightweight.",
    "krautrock": "Krautrock is a musical genre that emerged in the late 1960s, mainly represented by groups from West Germany. It is a general term used for bands playing experimental, underground, psychedelic, or partly electronic types of music. Krautrock is originally a subgenre of progressive rock, but instead of following Anglo-American models of jazz and classical music, the German musicians (often inspired by the use of psychedelic drugs) created a quite different sound. The popular myth that \"Krautrock\" was coined by the English music press is not true. The first known use of the term is to be found in a Popo Music agency advertisement placed in Melody Maker (3 April 1971) and then a few weeks later in the USA Billboard magazine (29 May 1971) promoting its concert organising and artists on the Frankfurt based Bacillus label. That set the seeds for the American and British press adopting it. Initially considered insulting as the word kraut is slang for a German person, referring to the German dish \"sauerkraut\", the negative connotation disappeared as the music made by these bands since then was highly appreciated. Today, the word is honoring rather than insulting. Typical Krautrock bands in the early 1970s were Amon Düül II, Faust, Can and other bands associated with the producer/engineers: Conny Plank (Neu!, Kraftwerk and Cluster) and Dieter Dierks (Ash Ra Tempel, Tangerine Dream, etc.). Another early key-player was Rolf-Ulrich Kaiser and his Ohr, Pilz and Kosmische Musik labels. The composer Karlheinz Stockhausen also had influence on this experimental scene. Nowadays Krautrock is seen as an \"umbrella\" catch-all for the whole underground and progressive/experimental scene that developed in Germany during the 1970s and subsequent bands inspired by that unique scene.",
    "hard+rock": "Hard rock (or heavy rock) is a loosely defined subgenre of rock music which has its earliest roots in mid-1960s garage rock, blues rock and psychedelic rock. It is typified by a heavy use of aggressive vocals, distorted electric guitars, bass guitar, drums, and often accompanied with pianos and keyboards.",
    "score": "A score is original music written specifically to accompany a dramatic presentation, such as a movie, television program, play, or video game. In the case of a medium recorded on film or video, the written score may be recorded and used as part of the soundtrack, which also includes dialogue and/or sound effects. Alternatively, the written score may be re-recorded for release to the public, so that the released recording is separate from the soundtrack. For example, John Williams's Star Wars is a score used as a film soundtrack. Franz Waxman's The Bride Of Frankenstein is a newly recorded version of the original score, and is not a film soundtrack. Cecil Payne's The Connection was written as the score for a play.",
    "mod": "The actual subculture that encompassed music, fashion, and the love of Vespa motor scooters and Italian fashion started in 1958 in London. Mod is short for Modernists, being either a fan or musician of modern jazz music. The influences to Mod culture consists of Jazz, R&B, power pop and soul. The first bands and artists that define the music are artists like Miles Davis and Ronnie Scott. The Who, Small Faces, and The Jam was rock bands favoured by the Mods due to the lyrics relation and revivalism of the culture. The Who's album Quadrophenia and the movie by the same name is a must listen and a must watch, as it was the soundtrack to the well known Mod movie of the same name.",
    "country+rock": "\"The typical country-rock song was an identifiable \"rock\" creation that used at least one element of standard country instrumentation, be it pedal steel or fiddle, kept the arrangement largely acoustic except for bass, and utilized countryish, Appalachian-style harmonies.\"",
    "public+broadcast": "\"Public Broadcast\" is a style under Non-Music, mainly with voice-overs, ads, track mixing, etc. Be careful with releases made for distribution to AFRTS (American Forces Radio and Television Service) stations: 'Transcription' covers the licensing end of the release. It's like the Promo format tag.  'Public Broadcast' covers the content end. It is a semi-meta style in which the recording can contain music, PSA's, promotional material, interviews, and interstitial announcer spoken word sequenced for contiguous broadcast (or a recording of such). Some releases are both, some releases are either or neither. There's definite overlap. The modern equivalent would be a (downloadable) podcast, which Staff has okayed for use under this tag.",
    "fusion": "Fusion or Jazz Fusion is a subgenre of Jazz with elements of Progressive, Psychedelic rock music. It also has elements of Funk, Bebop, and 20th Century Classical Music. The Genre's Orgins come from The Late 1960s.",
    "folk": "In a nutshell, Folk music is \"local music from out there\" or \"someone else's local music\". Contemporary Folk refers to post-Bob Dylan folk singer/songwriters of the 70s and beyond. Prior to Dylan, most folk performers interpreted classic folk songs or wrote broad-based, topical songs.",
    "psychedelic": "Music genre that emerged in the late 1960s in which soul musicians embraced elements of psychedelic rock, including its production techniques, instrumentation, effects units (fuzz, wah-wah, phaser, etc.), as well as drug influences.",
    "electronic": "Electronic music is music that employs electronic musical instruments and electronic music technology in its production, an electronic musician being a musician who composes and/or performs such music. In general a distinction can be made between sound produced using electromechanical means and that produced using electronic technology. Examples of electromechanical sound producing devices include the telharmonium, Hammond organ, and the electric guitar. Purely electronic sound production can be achieved using devices such as the theremin, sound synthesizer, and computer.",
    "classic+rock": "Classic Rock was a genre mostly defined by US FM radio formats in the 1970s, growing out of the earlier Album Oriented Rock (AOR) format. It was a harder, often Blues and Prog influenced style and was a reaction against both Punk / New Wave and Disco. This style is not correctly applied to sixties or 70s Pop Rock, Beat or Garage Rock bands, such as The Beatles, The Yardbirds or The Rolling Stones (pre 1978). Other forms of Classic Rock: Southern rock is a subgenre of rock music and a genre of Americana. It developed in the Southern United States from rock and roll, country music, and blues and folk music.",
    "ballad": "A popular narrative song passed down orally. In the English tradition, it usually follows a form of rhymed (abcb) quatrains alternating four-stress and three-stress lines. Folk (or traditional) ballads are anonymous and recount tragic, comic, or heroic stories with emphasis on a central dramatic event; examples include “Barbara Allen” and “John Henry.”",
    "folk,+world,+&+country": "This genre, as well as covering country, also encompasses many different styles of music from around the world, most of which are region-specific, such as Asian, African, and various location-specific forms of classical. Discogs has now provided many highly specific style tags for these, which will help to bring much more accuracy to your entries, as world music on its own is very vague as a description.",
    "soundtrack": "Music accompanying, featured in or inspired by a motion picture, television program or video game.",
    "garage+rock": "Raw, energetic and primal variety of rock and roll that flourished in the mid-1960s as many young people, inspired by The Beatles, decided to form bands. Precursor to psychedelic rock, garage rock is characterized by sometimes aggressive and unsophisticated lyrics and delivery, typically using guitars distorted through a fuzzbox. At the time there was no specific label and garage rock was not recognized as a separate genre, but critical recognition in the early 1970s through the release of the the Nuggets compilation albums did much to define and memorialize the style. The term derives from the perception the groups were young amateurs who rehearsed in their family garage, although many were professionals and never played in a garage at all.",
    "psychedelic+rock": "Psychedelic rock is a style of rock music that is inspired or influenced by psychedelic culture and attempts to replicate and enhance the mind-altering experiences of psychedelic drugs. It often uses new recording techniques and effects and draws on non-Western sources such as the ragas and drones of Indian music.",
    "acid+rock": "Acid Rock is a form of Rock Music which evolved from Psychedelic Rock and Psychedelic Music in general. Although Acid Rock is very similar to Psychedelic Rock, Acid Rock has more Blues, Folk, and Hard Rock aspects, than most Psychedelic Music. Just like Psychedelic Rock, Acid Rock also has its origins in the mid-1960s. It has also been noted that Acid Rock is considered to be more Heavy, Harsh, Hard, and Louder sound than its Psychedelic influences. Also, the lyrics usually contain drug references, and has long, usually improvised guitar solos, with distinct effects.",
    "symphonic+rock": "Symphonic rock is a sub-genre of progressive rock. Since early in progressive rock's history, the term has been used to distinguish more classically influenced progressive rock from the more psychedelic and experimental forms of progressive rock.",
    "prog+rock": "Progressive rock is a rock music subgenre that originated in the United Kingdom and United States throughout the mid to late 1960s. It developed from psychedelic rock, and began as an attempt to give greater artistic weight and credibility to rock music. Songs were replaced by musical suites that often stretched to 20 or 40 minutes in length and contained symphonic influences, extended musical themes, fantasy-like ambience and lyrics, and complex orchestrations.",
    "romantic": "Compared to its predecessors, music from the romantic era is more fluid, emotional, personal, secular, and experimental. It was written more for middle-class audiences, and it heavily influenced film music throughout the 20th Century. Schubert, Schumann, Mendelssohn and Brahms represent the more conservative side of romanticism, and Berlioz, Strauss, Tchaikovsky, Wagner, Chopin, Debussy, and Holst represent the more experimental side.",
    "soft+rock": "Simply put, it features the instruments and elements of Pop Rock, but it's much softer/lighter in nature. May also be referred to as \"light rock\" or \"easy rock\". The style originated in the early 1970s, partly as a reaction to the hard rock which had become popular towards the end of the 1960s. Songs were generally commercial and innocuous, with less rock & roll than had been evident in the Pop Rock of the 1960s Beat era. Soft Rock ontstond in de vroege jaren '70, gedeeltelijk als reactie op de extreme geluiden van eind jaren '60. Softrock was commercieel en onschadelijk, nam het geluid van singer-songwriter en pop-rock maar maakte alle randen glad.",
    "stage+&+screen": "This genre is reserved for music associated with musicals, soundtracks, plays, and other scores.",
    "rock": "Rock music or rock and roll in full name is a genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the late 1950s, 1960s and later, particularly in the United Kingdom and the United States. Its roots are in 1950s' American rock and roll when and where it first started, itself heavily influenced by rhythm and blues and country music. Rock music also drew strongly on a number of other genres such as blues and folk, and incorporated influences from jazz, classical and other musical sources. In its purest form, Rock & Roll has three chords, a strong, insistent back beat, and a catchy melody. Early rock & roll drew from a variety of sources, primarily blues, R&B, and country, but also gospel, traditional pop, jazz, and folk. All of these influences combined in a simple, blues-based song structure that was fast, danceable, and catchy. The first wave of rock & rollers -- Chuck Berry, Elvis Presley, Little Richard, Jerry Lee Lewis, Buddy Holly, Bo Diddley, Bill Haley, Gene Vincent, the Everly Brothers, and Carl Perkins, among many others -- set the template for rock & roll that was followed over the next four decades.",
    "chanson": "A chanson is in general any lyric-driven French song, usually polyphonic and secular. A singer specializing in chansons is known as a \"chanteur\" (male) or \"chanteuse\" (female); a collection of chansons, especially from the late Middle Ages and Renaissance, is also known as a chansonnier.",
    "folk+rock": "Folk rock is a musical genre combining elements of folk music and rock music. In its earliest and narrowest sense, the term referred to a genre that arose in the United States and the UK around the mid-1960s. The genre was pioneered by the Los Angeles band The Byrds, who began playing traditional folk music and Bob Dylan-penned material with rock instrumentation, in a style heavily influenced by The Beatles and other British bands. The term \"folk rock\" was itself first coined by the U.S. music press to describe The Byrds' music in June 1965, the same month that the band's debut album was issued. The release of The Byrds' cover version of Dylan's \"Mr. Tambourine Man\" and its subsequent commercial success initiated the folk rock explosion of the mid-1960s. Dylan himself was also influential on the genre, particularly his recordings with an electric rock band on the Bringing It All Back Home, Highway 61 Revisited, and Blonde on Blonde albums. Dylan's 25 July 1965 appearance at the Newport Folk Festival with an electric backing band is also considered a pivotal moment in the development of folk rock.",
    "theme": "The main theme or signature song from a motion picture, television program, video game or musical.",
    "jazz": "Jazz is a genre of music that originated in African-American communities during the late 19th and early 20th century. Jazz emerged in many parts of the United States of independent popular musical styles; linked by the common bonds of European American and African-American musical parentage with a performance orientation. Jazz spans a range of music from ragtime to the present day—a period of over 100 years—and has proved to be very difficult to define. Jazz makes heavy use of improvisation, polyrhythms, syncopation, and the swung note, as well as aspects of European harmony, American popular music, the brass band tradition, and African musical elements such as blue notes and ragtime. A musical group that plays jazz is called a jazz band. While New Orleans jazz has improvised ensembles, when jazz started becoming popular in the 1920s and demand was growing for larger dance bands, it became necessary for ensembles to be written down, particularly when a group included more than three...",
    "disco": "One of the main genres of dance music of the XX century, which arose in the early 1970s.",
    "funk+/+soul": "Funk is a music genre that originated in the mid to late 1960s when African-American musicians created a rhythmic, danceable new form of music through a mixture of soul music, jazz, and R&B. Funk de-emphasizes melody and harmony and brings a strong rhythmic groove of electric bass and drums to the foreground. Funk songs are often based on an extended vamp on a single chord, distinguishing them from R&B and soul songs, which are built on chord progressions. Funk uses the same extended chords found in bebop jazz, such as minor chords with added sevenths and elevenths, or dominant seventh chords with altered ninths. Soul music is a popular music genre that originated in the United States in the 1950s and early 1960s. It combined elements of African-American gospel music, rhythm and blues, and often jazz. Soul music became popular for dancing and listening in the United States—where record labels such as Motown, Atlantic and Stax labels were influential during the period of the civil rights movement. Soul also became popular around the world, directly influencing rock music and the music of Africa. Northern Soul music was a  type of soul music that emerged from northern England in the 1960s. It was fresh, new, and upbeat (usually over 100 bpm). It was also sang by white and black people. The Northern Soul boom was between about 1965-1975. The Wigan Casino, Twisted Wheel, and Golden torch were some Northern Soul clubs, groups, and casinos that were Northern Soul hubs. Deep funk revival, naturally enough, grew out of a renewal of interest in deep (read: obscure) funk on both sides of the Atlantic, mostly among DJs and record collectors. Whether they were looking for fresh sample material or just a great overlooked dance. Retro-Soul is soul music that was made after the heyday of soul music had passed. Although deep soul had fallen out of the spotlight in the early '70s, there were a number of artists that never stopped singing in that raw style. In the mid-'80s, a small b...",
    "rhythm+&+blues": "Rhythmic style, derived from blues, which was highly influential on soul and a precursor to rock n roll.  Releases employing the more recent, post-soul meaning of the term R&B come under the tags New Jack Swing or Contemporary R&B. Discogs prefers to specify one or the other now, as opposed to the less precise RnB/Swing tag. Rhythm and blues, often abbreviated as R&B, is a genre of popular music that originated in African-American communities in the 1940s. The term was originally used by record companies to describe recordings marketed predominantly to urban African American music.",
    "glam": "The original Glam was a poppy UK (and NYC) pre-punk style that was often rhythm heavy, albeit with short snappy, almost Rock & Roll, songs. The artists wore heavy makeup and often outrageous costumes. It heavily influenced the second style below, and the UK punk revolution of 1976.  Poppy heavy metal music popular throughout the later 1980's and the first part of the 1990's. Vocals are usually harmonized and the songs are very accessible by mass audiences. Glam metal, also known as hair metal or pop metal, is a subgenre of heavy metal.",
    "art+rock": "rock music that incorporates elements of high art, particularly from classical realms",
    "experimental": "Experimental music consciously deviates from established musical norms (of a particular genre, or of music in general). Music of almost any genre can be considered experimental – but the term is often associated with the more abstract and challenging strains of electronic music, jazz, and rock. Avantgarde has its own tag. Experimental music might explore new compositional techniques (e.g., John Cage's use of the I Ching, or Steve Reich's process music), new musical forms (but drone and free improvisation have their own tags), unusual instruments (e.g., the theremin, or Harry Partch's homemade instruments), extramusical sounds (e.g., Matmos, but musique concrète has its own tag), \"extended technique\" (playing instruments in unusual ways – e.g., Cage's prepared piano), microtonal scales, minimalism (e.g., lowercase music), unexpected stylistic fusions, abrasive timbres and rhythms, or experiments in any other aspect of music. As such, \"experimental music\" isn't really a single style with a distinct sound. It's more of a sensibility: an effort to explore new musical frontiers, and to expand the boundaries of musical experience. There is major potential for overuse of this tag, which can be thinned out via use of the various others mentioned on this page instead.",
    "pop": "Pop music (a term that originally derives from an abbreviation of \"popular\") is a genre of popular music, which originated in its modern form in the 1950s, deriving from rock and roll. The terms \"popular music\" and \"pop music\" are often used interchangeably, even though the former is a description of music which is popular (and can include any style). On Discogs, the Pop genre \"can and should be used with any other genre to tag items as being mainstream, chart orientated works.\"",
    "blues+rock": "A Soul, Blues, and Rock mixture. Usually a form  of Blue-Eyed Soul.",
    "beat": "Beat music, British beat, or Merseybeat (after bands from Liverpool and nearby areas beside the River Mersey) is a rock music genre that developed in the United Kingdom in the early 1960s. Beat music is a style of rock and roll influenced by Chuck Berry guitar style and the midtempo beat of artists like Buddy Holly. It also adds a fusion of doo-wop, skiffle and R&B. The genre provided many of the bands responsible for the British Invasion of the American pop charts starting in 1964, and provided the model for many important developments in pop and rock music, including the format of the rock group around lead, rhythm and bass guitars with drums.",
    "political": "Can describe a recording of a political speech, political advertisements, propaganda, debates, or campaign promotions. Can be used for records containing propaganda songs, in conjunction with music styles such as Vocal, Neo-Romantic etc.",
    "blues": "Blues was originated in the Deep South of the United States around the 1870s by African-Americans from roots in African musical traditions, African-American work songs, and spirituals. Blues incorporated spirituals, work songs, field hollers, shouts, chants, and rhymed simple narrative ballads. The blues form, ubiquitous in jazz, rhythm and blues and rock and roll, is characterized by the call-and-response pattern, the blues scale and specific chord progressions, of which the twelve-bar blues is the most common. Blue notes (or \"worried notes\"), usually thirds, fifths or sevenths flattened in pitch are also an essential part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect known as the groove. Delta blues is one of the earliest-known styles of blues. It originated in the Mississippi Delta, and is regarded as a regional variant of country blues. Guitar and harmonica are its dominant instruments; slide guitar is a hallmark of the style.",
    "avantgarde": "Avant-garde music is music that is considered to be at the forefront of experimentation or innovation in its field.",
    "jazz-rock": "Jazz-rock may refer to the loudest, wildest, most electrified fusion bands from the jazz camp, but most often it describes performers coming from the rock side of the equation. Jazz-rock first emerged during the late '60s as an attempt to fuse the visceral power of rock with the musical complexity and improvisational fireworks of jazz. Since rock often emphasized directness and simplicity over virtuosity, jazz-rock generally grew out of the most artistically ambitious rock subgenres of the late '60s and early '70s: psychedelia, progressive rock, and the singer/songwriter movement. The latter drew from the mellower, more cerebral side of jazz, often employing vocal as well as instrumental improvisation; this school's major figures included Joni Mitchell, Van Morrison, and Tim Buckley. Most jazz-rock, however, was played by higher-energy rock ensembles. Some of them were more jam-oriented, borrowing jazz harmonies and instruments for their extended, rock-flavored improvisations (Traffic, Santana). Others recorded jazz-flavored R&B or pop songs that used the melodic, harmonic, and rhythmic sensibilities of jazz, but weren't as interested in improvisation or instrumental virtuosity (Blood, Sweat & Tears, Chicago, Steely Dan). Still others used jazz's complexity to expand rock's musical horizons, not just in terms of instrumental technique but in crafting quirky, challenging, unpredictable compositions (Frank Zappa, the Soft Machine). The major exception was Miles Davis, the first jazz musician since the early R&B era to covet the earthy power of rock & roll and the impact it had on young audiences. Starting with 1970's Bitches Brew, Davis' early-'70s fusion workouts -- greatly inspired by Jimi Hendrix and Sly & the Family Stone -- quickly became some of the funkiest, edgiest, most aggressive jazz-rock ever recorded. While figures like Zappa and $Steely Dan continued to record jazz-rock through the '70s, the movement had essentially dissipated by the '80s, as a mellower form of fusion captured its audience. Not to be confused with Jazz-Rock Fusion: https://www.discogs.com/style/fusion",
    "vocal": "Although nearly all pop music involves sung vocals, in Vocal pop music, there is an exceptional emphasis on a virtuosic, solo vocal performance which carries almost the entire melody. The backing music is often a relatively simple accompaniment by chords in a lower register, although it can include lush orchestral or big-band arrangements as well. Rhythm sections tend to be very subdued, if present at all. Record shops and collectors typically use the term Vocal in reference to mainstream, \"white\", \"adult\" English-language pop music of the 1950s and 1960s: mainly ballads and standards which continue the tradition of vocal jazz, without the improvisational elements. The style's peak coincided with the early rock & roll era, after which most Vocal pop became regarded as \"easy listening\" music, but it continues to enjoy waves of popularity throughout the world to the present day. On Discogs, perhaps due to unfamiliarity with the style, the Vocal tag is not used so strictly. It is found on all kinds of pop releases from all eras, whenever a vocal solo dominates the performance. However, it should not be used on just any pop music with vocals. It is inappropriate for especially highly rhythmic pop or music which is better tagged with a regional style such as Chanson (French-language vocal pop) or a style under the Folk, World & Country genre.",
    "classical": "Classical music is art music produced or rooted in the traditions of Western music (both liturgical and secular). It encompasses a broad span of time from roughly the 11th century to the present day. The central norms of this tradition became codified between 1550 and 1900, which is known as the common practice period. The major time divisions of classical music are as follows: the early music period, which includes Medieval (500–1400) and the Renaissance (1400–1600); the Common practice period, which includes the Baroque (1600–1750), Classical (1750–1830) and Romantic (1804–1910); the 20th century (1901–2000) which includes the modern period (1890-1930) that overlaps from the late 19th-century, the high modern (mid 20th-century), and contemporary (1975–2000) period, the last of which overlaps into the 21st-century.",
    "soul": "Soul music is a popular music genre that originated in the United States in the 1950s and early 1960s. It combined elements of African-American gospel music, rhythm and blues, and often jazz. Soul music became popular for dancing and listening in the United States—where record labels such as Motown, Atlantic and Stax labels were influential during the period of the civil rights movement. Soul also became popular around the world, directly influencing rock music and the music of Africa. Like Southern soul, Deep Soul is gritty, funky soul music that borrows equally from the fervor of Southern gospel and the hard-driving energy of R&B.",
    "rock+&+roll": "Rock music or rock and roll in full name is a genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the late 1950s, 1960s and later, particularly in the United Kingdom and the United States. Its roots are in 1950s' American rock and roll when and where it first started, itself heavily influenced by rhythm and blues and country music. Rock music also drew strongly on a number of other genres such as blues and folk, and incorporated influences from jazz, classical and other musical sources.",
    "space+rock": "Space Rock is a style that evolved out of psychedelic and progressive rock music.  The style is known for having lyrics related to Space and Sci-Fi topics.  It's also known for having spacey effects in their music."
}